frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
/**
 * \file
 *
 * \brief Component description for USART
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_USART_COMPONENT_
#define _SAM4L_USART_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR USART */
/* ========================================================================== */
/** \addtogroup SAM4L_USART Universal Synchronous Asynchronous Receiver Transmitter */
/*@{*/

#define USART_I7601
#define REV_USART                   0x6021

/* -------- US_CR : (USART Offset: 0x00) ( /W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct { // LIN mode
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t RSTRX:1;          /*!< bit:      2  Reset Receiver                     */
    uint32_t RSTTX:1;          /*!< bit:      3  Reset Transmitter                  */
    uint32_t RXEN:1;           /*!< bit:      4  Receiver Enable                    */
    uint32_t RXDIS:1;          /*!< bit:      5  Receiver Disable                   */
    uint32_t TXEN:1;           /*!< bit:      6  Transmitter Enable                 */
    uint32_t TXDIS:1;          /*!< bit:      7  Transmitter Disable                */
    uint32_t RSTSTA:1;         /*!< bit:      8  Reset Status Bits                  */
    uint32_t STTBRK:1;         /*!< bit:      9  Start Break                        */
    uint32_t STPBRK:1;         /*!< bit:     10  Stop Break                         */
    uint32_t STTTO:1;          /*!< bit:     11  Start Time-out                     */
    uint32_t SENDA:1;          /*!< bit:     12  Send Address                       */
    uint32_t RSTIT:1;          /*!< bit:     13  Reset Iterations                   */
    uint32_t RSTNACK:1;        /*!< bit:     14  Reset Non Acknowledge              */
    uint32_t RETTO:1;          /*!< bit:     15  Rearm Time-out                     */
    uint32_t DTREN:1;          /*!< bit:     16  Data Terminal Ready Enable         */
    uint32_t DTRDIS:1;         /*!< bit:     17  Data Terminal Ready Disable        */
    uint32_t RTSEN:1;          /*!< bit:     18  Request to Send Enable             */
    uint32_t RTSDIS:1;         /*!< bit:     19  Request to Send Disable            */
    uint32_t LINABT:1;         /*!< bit:     20  Abort the current LIN transmission */
    uint32_t LINWKUP:1;        /*!< bit:     21  Sends a wakeup signal on the LIN bus */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } LIN;                       /*!< Structure used for LIN                          */
  struct { // SPI_MASTER mode
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t RSTRX:1;          /*!< bit:      2  Reset Receiver                     */
    uint32_t RSTTX:1;          /*!< bit:      3  Reset Transmitter                  */
    uint32_t RXEN:1;           /*!< bit:      4  Receiver Enable                    */
    uint32_t RXDIS:1;          /*!< bit:      5  Receiver Disable                   */
    uint32_t TXEN:1;           /*!< bit:      6  Transmitter Enable                 */
    uint32_t TXDIS:1;          /*!< bit:      7  Transmitter Disable                */
    uint32_t RSTSTA:1;         /*!< bit:      8  Reset Status Bits                  */
    uint32_t STTBRK:1;         /*!< bit:      9  Start Break                        */
    uint32_t STPBRK:1;         /*!< bit:     10  Stop Break                         */
    uint32_t STTTO:1;          /*!< bit:     11  Start Time-out                     */
    uint32_t SENDA:1;          /*!< bit:     12  Send Address                       */
    uint32_t RSTIT:1;          /*!< bit:     13  Reset Iterations                   */
    uint32_t RSTNACK:1;        /*!< bit:     14  Reset Non Acknowledge              */
    uint32_t RETTO:1;          /*!< bit:     15  Rearm Time-out                     */
    uint32_t DTREN:1;          /*!< bit:     16  Data Terminal Ready Enable         */
    uint32_t DTRDIS:1;         /*!< bit:     17  Data Terminal Ready Disable        */
    uint32_t FCS:1;            /*!< bit:     18  Force SPI Chip Select              */
    uint32_t RCS:1;            /*!< bit:     19  Release SPI Chip Select            */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } SPI_MASTER;                /*!< Structure used for SPI_MASTER                   */
  struct { // USART mode
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t RSTRX:1;          /*!< bit:      2  Reset Receiver                     */
    uint32_t RSTTX:1;          /*!< bit:      3  Reset Transmitter                  */
    uint32_t RXEN:1;           /*!< bit:      4  Receiver Enable                    */
    uint32_t RXDIS:1;          /*!< bit:      5  Receiver Disable                   */
    uint32_t TXEN:1;           /*!< bit:      6  Transmitter Enable                 */
    uint32_t TXDIS:1;          /*!< bit:      7  Transmitter Disable                */
    uint32_t RSTSTA:1;         /*!< bit:      8  Reset Status Bits                  */
    uint32_t STTBRK:1;         /*!< bit:      9  Start Break                        */
    uint32_t STPBRK:1;         /*!< bit:     10  Stop Break                         */
    uint32_t STTTO:1;          /*!< bit:     11  Start Time-out                     */
    uint32_t SENDA:1;          /*!< bit:     12  Send Address                       */
    uint32_t RSTIT:1;          /*!< bit:     13  Reset Iterations                   */
    uint32_t RSTNACK:1;        /*!< bit:     14  Reset Non Acknowledge              */
    uint32_t RETTO:1;          /*!< bit:     15  Rearm Time-out                     */
    uint32_t DTREN:1;          /*!< bit:     16  Data Terminal Ready Enable         */
    uint32_t DTRDIS:1;         /*!< bit:     17  Data Terminal Ready Disable        */
    uint32_t RTSEN:1;          /*!< bit:     18  Request to Send Enable             */
    uint32_t RTSDIS:1;         /*!< bit:     19  Request to Send Disable            */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } USART;                     /*!< Structure used for USART                        */
  uint32_t reg;                /*!< Type      used for register access              */
} US_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

