frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// USART mode
#define US_CR_USART_RSTRX_Pos       2            /**< \brief (US_CR_USART) Reset Receiver */
#define US_CR_USART_RSTRX           (_U(0x1) << US_CR_USART_RSTRX_Pos)
#define   US_CR_USART_RSTRX_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTRX_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Resets the receiver */
#define US_CR_USART_RSTRX_0         (US_CR_USART_RSTRX_0_Val       << US_CR_USART_RSTRX_Pos)
#define US_CR_USART_RSTRX_1         (US_CR_USART_RSTRX_1_Val       << US_CR_USART_RSTRX_Pos)
#define US_CR_USART_RSTTX_Pos       3            /**< \brief (US_CR_USART) Reset Transmitter */
#define US_CR_USART_RSTTX           (_U(0x1) << US_CR_USART_RSTTX_Pos)
#define   US_CR_USART_RSTTX_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTTX_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Resets the transmitter */
#define US_CR_USART_RSTTX_0         (US_CR_USART_RSTTX_0_Val       << US_CR_USART_RSTTX_Pos)
#define US_CR_USART_RSTTX_1         (US_CR_USART_RSTTX_1_Val       << US_CR_USART_RSTTX_Pos)
#define US_CR_USART_RXEN_Pos        4            /**< \brief (US_CR_USART) Receiver Enable */
#define US_CR_USART_RXEN            (_U(0x1) << US_CR_USART_RXEN_Pos)
#define   US_CR_USART_RXEN_0_Val          _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RXEN_1_Val          _U(0x1)   /**< \brief (US_CR_USART) Enables the receiver, if RXDIS is 0 */
#define US_CR_USART_RXEN_0          (US_CR_USART_RXEN_0_Val        << US_CR_USART_RXEN_Pos)
#define US_CR_USART_RXEN_1          (US_CR_USART_RXEN_1_Val        << US_CR_USART_RXEN_Pos)
#define US_CR_USART_RXDIS_Pos       5            /**< \brief (US_CR_USART) Receiver Disable */
#define US_CR_USART_RXDIS           (_U(0x1) << US_CR_USART_RXDIS_Pos)
#define   US_CR_USART_RXDIS_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RXDIS_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Disables the receiver */
#define US_CR_USART_RXDIS_0         (US_CR_USART_RXDIS_0_Val       << US_CR_USART_RXDIS_Pos)
#define US_CR_USART_RXDIS_1         (US_CR_USART_RXDIS_1_Val       << US_CR_USART_RXDIS_Pos)
#define US_CR_USART_TXEN_Pos        6            /**< \brief (US_CR_USART) Transmitter Enable */
#define US_CR_USART_TXEN            (_U(0x1) << US_CR_USART_TXEN_Pos)
#define   US_CR_USART_TXEN_0_Val          _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_TXEN_1_Val          _U(0x1)   /**< \brief (US_CR_USART) Enables the transmitter if TXDIS is 0 */
#define US_CR_USART_TXEN_0          (US_CR_USART_TXEN_0_Val        << US_CR_USART_TXEN_Pos)
#define US_CR_USART_TXEN_1          (US_CR_USART_TXEN_1_Val        << US_CR_USART_TXEN_Pos)
#define US_CR_USART_TXDIS_Pos       7            /**< \brief (US_CR_USART) Transmitter Disable */
#define US_CR_USART_TXDIS           (_U(0x1) << US_CR_USART_TXDIS_Pos)
#define   US_CR_USART_TXDIS_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_TXDIS_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Disables the transmitter */
#define US_CR_USART_TXDIS_0         (US_CR_USART_TXDIS_0_Val       << US_CR_USART_TXDIS_Pos)
#define US_CR_USART_TXDIS_1         (US_CR_USART_TXDIS_1_Val       << US_CR_USART_TXDIS_Pos)
#define US_CR_USART_RSTSTA_Pos      8            /**< \brief (US_CR_USART) Reset Status Bits */
#define US_CR_USART_RSTSTA          (_U(0x1) << US_CR_USART_RSTSTA_Pos)
#define   US_CR_USART_RSTSTA_0_Val        _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTSTA_1_Val        _U(0x1)   /**< \brief (US_CR_USART) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_USART_RSTSTA_0        (US_CR_USART_RSTSTA_0_Val      << US_CR_USART_RSTSTA_Pos)
#define US_CR_USART_RSTSTA_1        (US_CR_USART_RSTSTA_1_Val      << US_CR_USART_RSTSTA_Pos)
#define US_CR_USART_STTBRK_Pos      9            /**< \brief (US_CR_USART) Start Break */
#define US_CR_USART_STTBRK          (_U(0x1) << US_CR_USART_STTBRK_Pos)
#define   US_CR_USART_STTBRK_0_Val        _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_STTBRK_1_Val        _U(0x1)   /**< \brief (US_CR_USART) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_USART_STTBRK_0        (US_CR_USART_STTBRK_0_Val      << US_CR_USART_STTBRK_Pos)
#define US_CR_USART_STTBRK_1        (US_CR_USART_STTBRK_1_Val      << US_CR_USART_STTBRK_Pos)
#define US_CR_USART_STPBRK_Pos      10           /**< \brief (US_CR_USART) Stop Break */
#define US_CR_USART_STPBRK          (_U(0x1) << US_CR_USART_STPBRK_Pos)
#define   US_CR_USART_STPBRK_0_Val        _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_STPBRK_1_Val        _U(0x1)   /**< \brief (US_CR_USART) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_USART_STPBRK_0        (US_CR_USART_STPBRK_0_Val      << US_CR_USART_STPBRK_Pos)
#define US_CR_USART_STPBRK_1        (US_CR_USART_STPBRK_1_Val      << US_CR_USART_STPBRK_Pos)
#define US_CR_USART_STTTO_Pos       11           /**< \brief (US_CR_USART) Start Time-out */
#define US_CR_USART_STTTO           (_U(0x1) << US_CR_USART_STTTO_Pos)
#define   US_CR_USART_STTTO_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_STTTO_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Starts waiting for a character before clocking the time-out counter */
#define US_CR_USART_STTTO_0         (US_CR_USART_STTTO_0_Val       << US_CR_USART_STTTO_Pos)
#define US_CR_USART_STTTO_1         (US_CR_USART_STTTO_1_Val       << US_CR_USART_STTTO_Pos)
#define US_CR_USART_SENDA_Pos       12           /**< \brief (US_CR_USART) Send Address */
#define US_CR_USART_SENDA           (_U(0x1) << US_CR_USART_SENDA_Pos)
#define   US_CR_USART_SENDA_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_SENDA_1_Val         _U(0x1)   /**< \brief (US_CR_USART) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_USART_SENDA_0         (US_CR_USART_SENDA_0_Val       << US_CR_USART_SENDA_Pos)
#define US_CR_USART_SENDA_1         (US_CR_USART_SENDA_1_Val       << US_CR_USART_SENDA_Pos)
#define US_CR_USART_RSTIT_Pos       13           /**< \brief (US_CR_USART) Reset Iterations */
#define US_CR_USART_RSTIT           (_U(0x1) << US_CR_USART_RSTIT_Pos)
#define   US_CR_USART_RSTIT_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTIT_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_USART_RSTIT_0         (US_CR_USART_RSTIT_0_Val       << US_CR_USART_RSTIT_Pos)
#define US_CR_USART_RSTIT_1         (US_CR_USART_RSTIT_1_Val       << US_CR_USART_RSTIT_Pos)
#define US_CR_USART_RSTNACK_Pos     14           /**< \brief (US_CR_USART) Reset Non Acknowledge */
#define US_CR_USART_RSTNACK         (_U(0x1) << US_CR_USART_RSTNACK_Pos)
#define   US_CR_USART_RSTNACK_0_Val       _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RSTNACK_1_Val       _U(0x1)   /**< \brief (US_CR_USART) Resets NACK in CSR */
#define US_CR_USART_RSTNACK_0       (US_CR_USART_RSTNACK_0_Val     << US_CR_USART_RSTNACK_Pos)
#define US_CR_USART_RSTNACK_1       (US_CR_USART_RSTNACK_1_Val     << US_CR_USART_RSTNACK_Pos)
#define US_CR_USART_RETTO_Pos       15           /**< \brief (US_CR_USART) Rearm Time-out */
#define US_CR_USART_RETTO           (_U(0x1) << US_CR_USART_RETTO_Pos)
#define   US_CR_USART_RETTO_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RETTO_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Restart Time-out */
#define US_CR_USART_RETTO_0         (US_CR_USART_RETTO_0_Val       << US_CR_USART_RETTO_Pos)
#define US_CR_USART_RETTO_1         (US_CR_USART_RETTO_1_Val       << US_CR_USART_RETTO_Pos)
#define US_CR_USART_DTREN_Pos       16           /**< \brief (US_CR_USART) Data Terminal Ready Enable */
#define US_CR_USART_DTREN           (_U(0x1) << US_CR_USART_DTREN_Pos)
#define   US_CR_USART_DTREN_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_DTREN_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Drives the pin DTR at 0 */
#define US_CR_USART_DTREN_0         (US_CR_USART_DTREN_0_Val       << US_CR_USART_DTREN_Pos)
#define US_CR_USART_DTREN_1         (US_CR_USART_DTREN_1_Val       << US_CR_USART_DTREN_Pos)
#define US_CR_USART_DTRDIS_Pos      17           /**< \brief (US_CR_USART) Data Terminal Ready Disable */
#define US_CR_USART_DTRDIS          (_U(0x1) << US_CR_USART_DTRDIS_Pos)
#define   US_CR_USART_DTRDIS_0_Val        _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_DTRDIS_1_Val        _U(0x1)   /**< \brief (US_CR_USART) Drives the pin DTR to 1 */
#define US_CR_USART_DTRDIS_0        (US_CR_USART_DTRDIS_0_Val      << US_CR_USART_DTRDIS_Pos)
#define US_CR_USART_DTRDIS_1        (US_CR_USART_DTRDIS_1_Val      << US_CR_USART_DTRDIS_Pos)
#define US_CR_USART_RTSEN_Pos       18           /**< \brief (US_CR_USART) Request to Send Enable */
#define US_CR_USART_RTSEN           (_U(0x1) << US_CR_USART_RTSEN_Pos)
#define   US_CR_USART_RTSEN_0_Val         _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RTSEN_1_Val         _U(0x1)   /**< \brief (US_CR_USART) Drives the pin RTS to 0 */
#define US_CR_USART_RTSEN_0         (US_CR_USART_RTSEN_0_Val       << US_CR_USART_RTSEN_Pos)
#define US_CR_USART_RTSEN_1         (US_CR_USART_RTSEN_1_Val       << US_CR_USART_RTSEN_Pos)
#define US_CR_USART_RTSDIS_Pos      19           /**< \brief (US_CR_USART) Request to Send Disable */
#define US_CR_USART_RTSDIS          (_U(0x1) << US_CR_USART_RTSDIS_Pos)
#define   US_CR_USART_RTSDIS_0_Val        _U(0x0)   /**< \brief (US_CR_USART) No effect */
#define   US_CR_USART_RTSDIS_1_Val        _U(0x1)   /**< \brief (US_CR_USART) Drives the pin RTS to 1 */
#define US_CR_USART_RTSDIS_0        (US_CR_USART_RTSDIS_0_Val      << US_CR_USART_RTSDIS_Pos)
#define US_CR_USART_RTSDIS_1        (US_CR_USART_RTSDIS_1_Val      << US_CR_USART_RTSDIS_Pos)
#define US_CR_USART_MASK            _U(0x000FFFFC) /**< \brief (US_CR_USART) MASK Register */

// Any mode
#define US_CR_RSTRX_Pos             2            /**< \brief (US_CR) Reset Receiver */
#define US_CR_RSTRX                 (_U(0x1) << US_CR_RSTRX_Pos)
#define   US_CR_RSTRX_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RSTRX_1_Val               _U(0x1)   /**< \brief (US_CR) Resets the receiver */
#define US_CR_RSTRX_0               (US_CR_RSTRX_0_Val             << US_CR_RSTRX_Pos)
#define US_CR_RSTRX_1               (US_CR_RSTRX_1_Val             << US_CR_RSTRX_Pos)
#define US_CR_RSTTX_Pos             3            /**< \brief (US_CR) Reset Transmitter */
#define US_CR_RSTTX                 (_U(0x1) << US_CR_RSTTX_Pos)
#define   US_CR_RSTTX_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RSTTX_1_Val               _U(0x1)   /**< \brief (US_CR) Resets the transmitter */
#define US_CR_RSTTX_0               (US_CR_RSTTX_0_Val             << US_CR_RSTTX_Pos)
#define US_CR_RSTTX_1               (US_CR_RSTTX_1_Val             << US_CR_RSTTX_Pos)
#define US_CR_RXEN_Pos              4            /**< \brief (US_CR) Receiver Enable */
#define US_CR_RXEN                  (_U(0x1) << US_CR_RXEN_Pos)
#define   US_CR_RXEN_0_Val                _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RXEN_1_Val                _U(0x1)   /**< \brief (US_CR) Enables the receiver, if RXDIS is 0 */
#define US_CR_RXEN_0                (US_CR_RXEN_0_Val              << US_CR_RXEN_Pos)
#define US_CR_RXEN_1                (US_CR_RXEN_1_Val              << US_CR_RXEN_Pos)
#define US_CR_RXDIS_Pos             5            /**< \brief (US_CR) Receiver Disable */
#define US_CR_RXDIS                 (_U(0x1) << US_CR_RXDIS_Pos)
#define   US_CR_RXDIS_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RXDIS_1_Val               _U(0x1)   /**< \brief (US_CR) Disables the receiver */
#define US_CR_RXDIS_0               (US_CR_RXDIS_0_Val             << US_CR_RXDIS_Pos)
#define US_CR_RXDIS_1               (US_CR_RXDIS_1_Val             << US_CR_RXDIS_Pos)
#define US_CR_TXEN_Pos              6            /**< \brief (US_CR) Transmitter Enable */
#define US_CR_TXEN                  (_U(0x1) << US_CR_TXEN_Pos)
#define   US_CR_TXEN_0_Val                _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_TXEN_1_Val                _U(0x1)   /**< \brief (US_CR) Enables the transmitter if TXDIS is 0 */
#define US_CR_TXEN_0                (US_CR_TXEN_0_Val              << US_CR_TXEN_Pos)
#define US_CR_TXEN_1                (US_CR_TXEN_1_Val              << US_CR_TXEN_Pos)
#define US_CR_TXDIS_Pos             7            /**< \brief (US_CR) Transmitter Disable */
#define US_CR_TXDIS                 (_U(0x1) << US_CR_TXDIS_Pos)
#define   US_CR_TXDIS_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_TXDIS_1_Val               _U(0x1)   /**< \brief (US_CR) Disables the transmitter */
#define US_CR_TXDIS_0               (US_CR_TXDIS_0_Val             << US_CR_TXDIS_Pos)
#define US_CR_TXDIS_1               (US_CR_TXDIS_1_Val             << US_CR_TXDIS_Pos)
#define US_CR_RSTSTA_Pos            8            /**< \brief (US_CR) Reset Status Bits */
#define US_CR_RSTSTA                (_U(0x1) << US_CR_RSTSTA_Pos)
#define   US_CR_RSTSTA_0_Val              _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RSTSTA_1_Val              _U(0x1)   /**< \brief (US_CR) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_CR_RSTSTA_0              (US_CR_RSTSTA_0_Val            << US_CR_RSTSTA_Pos)
#define US_CR_RSTSTA_1              (US_CR_RSTSTA_1_Val            << US_CR_RSTSTA_Pos)
#define US_CR_STTBRK_Pos            9            /**< \brief (US_CR) Start Break */
#define US_CR_STTBRK                (_U(0x1) << US_CR_STTBRK_Pos)
#define   US_CR_STTBRK_0_Val              _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_STTBRK_1_Val              _U(0x1)   /**< \brief (US_CR) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_CR_STTBRK_0              (US_CR_STTBRK_0_Val            << US_CR_STTBRK_Pos)
#define US_CR_STTBRK_1              (US_CR_STTBRK_1_Val            << US_CR_STTBRK_Pos)
#define US_CR_STPBRK_Pos            10           /**< \brief (US_CR) Stop Break */
#define US_CR_STPBRK                (_U(0x1) << US_CR_STPBRK_Pos)
#define   US_CR_STPBRK_0_Val              _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_STPBRK_1_Val              _U(0x1)   /**< \brief (US_CR) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_CR_STPBRK_0              (US_CR_STPBRK_0_Val            << US_CR_STPBRK_Pos)
#define US_CR_STPBRK_1              (US_CR_STPBRK_1_Val            << US_CR_STPBRK_Pos)
#define US_CR_STTTO_Pos             11           /**< \brief (US_CR) Start Time-out */
#define US_CR_STTTO                 (_U(0x1) << US_CR_STTTO_Pos)
#define   US_CR_STTTO_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_STTTO_1_Val               _U(0x1)   /**< \brief (US_CR) Starts waiting for a character before clocking the time-out counter */
#define US_CR_STTTO_0               (US_CR_STTTO_0_Val             << US_CR_STTTO_Pos)
#define US_CR_STTTO_1               (US_CR_STTTO_1_Val             << US_CR_STTTO_Pos)
#define US_CR_SENDA_Pos             12           /**< \brief (US_CR) Send Address */
#define US_CR_SENDA                 (_U(0x1) << US_CR_SENDA_Pos)
#define   US_CR_SENDA_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_SENDA_1_Val               _U(0x1)   /**< \brief (US_CR) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_CR_SENDA_0               (US_CR_SENDA_0_Val             << US_CR_SENDA_Pos)
#define US_CR_SENDA_1               (US_CR_SENDA_1_Val             << US_CR_SENDA_Pos)
#define US_CR_RSTIT_Pos             13           /**< \brief (US_CR) Reset Iterations */
#define US_CR_RSTIT                 (_U(0x1) << US_CR_RSTIT_Pos)
#define   US_CR_RSTIT_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RSTIT_1_Val               _U(0x1)   /**< \brief (US_CR) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_CR_RSTIT_0               (US_CR_RSTIT_0_Val             << US_CR_RSTIT_Pos)
#define US_CR_RSTIT_1               (US_CR_RSTIT_1_Val             << US_CR_RSTIT_Pos)
#define US_CR_RSTNACK_Pos           14           /**< \brief (US_CR) Reset Non Acknowledge */
#define US_CR_RSTNACK               (_U(0x1) << US_CR_RSTNACK_Pos)
#define   US_CR_RSTNACK_0_Val             _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RSTNACK_1_Val             _U(0x1)   /**< \brief (US_CR) Resets NACK in CSR */
#define US_CR_RSTNACK_0             (US_CR_RSTNACK_0_Val           << US_CR_RSTNACK_Pos)
#define US_CR_RSTNACK_1             (US_CR_RSTNACK_1_Val           << US_CR_RSTNACK_Pos)
#define US_CR_RETTO_Pos             15           /**< \brief (US_CR) Rearm Time-out */
#define US_CR_RETTO                 (_U(0x1) << US_CR_RETTO_Pos)
#define   US_CR_RETTO_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RETTO_1_Val               _U(0x1)   /**< \brief (US_CR) Restart Time-out */
#define US_CR_RETTO_0               (US_CR_RETTO_0_Val             << US_CR_RETTO_Pos)
#define US_CR_RETTO_1               (US_CR_RETTO_1_Val             << US_CR_RETTO_Pos)
#define US_CR_DTREN_Pos             16           /**< \brief (US_CR) Data Terminal Ready Enable */
#define US_CR_DTREN                 (_U(0x1) << US_CR_DTREN_Pos)
#define   US_CR_DTREN_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_DTREN_1_Val               _U(0x1)   /**< \brief (US_CR) Drives the pin DTR at 0 */
#define US_CR_DTREN_0               (US_CR_DTREN_0_Val             << US_CR_DTREN_Pos)
#define US_CR_DTREN_1               (US_CR_DTREN_1_Val             << US_CR_DTREN_Pos)
#define US_CR_DTRDIS_Pos            17           /**< \brief (US_CR) Data Terminal Ready Disable */
#define US_CR_DTRDIS                (_U(0x1) << US_CR_DTRDIS_Pos)
#define   US_CR_DTRDIS_0_Val              _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_DTRDIS_1_Val              _U(0x1)   /**< \brief (US_CR) Drives the pin DTR to 1 */
#define US_CR_DTRDIS_0              (US_CR_DTRDIS_0_Val            << US_CR_DTRDIS_Pos)
#define US_CR_DTRDIS_1              (US_CR_DTRDIS_1_Val            << US_CR_DTRDIS_Pos)
#define US_CR_RTSEN_Pos             18           /**< \brief (US_CR) Request to Send Enable */
#define US_CR_RTSEN                 (_U(0x1) << US_CR_RTSEN_Pos)
#define   US_CR_RTSEN_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RTSEN_1_Val               _U(0x1)   /**< \brief (US_CR) Drives the pin RTS to 0 */
#define US_CR_RTSEN_0               (US_CR_RTSEN_0_Val             << US_CR_RTSEN_Pos)
#define US_CR_RTSEN_1               (US_CR_RTSEN_1_Val             << US_CR_RTSEN_Pos)
#define US_CR_FCS_Pos               18           /**< \brief (US_CR) Force SPI Chip Select */
#define US_CR_FCS                   (_U(0x1) << US_CR_FCS_Pos)
#define   US_CR_FCS_0_Val                 _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_FCS_1_Val                 _U(0x1)   /**< \brief (US_CR) Forces the Slave Select Line NSS (RTS pin) to 0, even if USART is no transmitting, in order to address SPI slave devices supporting the CSAAT Mode (Chip Select Active After Transfer) */
#define US_CR_FCS_0                 (US_CR_FCS_0_Val               << US_CR_FCS_Pos)
#define US_CR_FCS_1                 (US_CR_FCS_1_Val               << US_CR_FCS_Pos)
#define US_CR_RTSEN_Pos             18           /**< \brief (US_CR) Request to Send Enable */
#define US_CR_RTSEN                 (_U(0x1) << US_CR_RTSEN_Pos)
#define   US_CR_RTSEN_0_Val               _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RTSEN_1_Val               _U(0x1)   /**< \brief (US_CR) Drives the pin RTS to 0 */
#define US_CR_RTSEN_0               (US_CR_RTSEN_0_Val             << US_CR_RTSEN_Pos)
#define US_CR_RTSEN_1               (US_CR_RTSEN_1_Val             << US_CR_RTSEN_Pos)
#define US_CR_RTSDIS_Pos            19           /**< \brief (US_CR) Request to Send Disable */
#define US_CR_RTSDIS                (_U(0x1) << US_CR_RTSDIS_Pos)
#define   US_CR_RTSDIS_0_Val              _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RTSDIS_1_Val              _U(0x1)   /**< \brief (US_CR) Drives the pin RTS to 1 */
#define US_CR_RTSDIS_0              (US_CR_RTSDIS_0_Val            << US_CR_RTSDIS_Pos)
#define US_CR_RTSDIS_1              (US_CR_RTSDIS_1_Val            << US_CR_RTSDIS_Pos)
#define US_CR_RCS_Pos               19           /**< \brief (US_CR) Release SPI Chip Select */
#define US_CR_RCS                   (_U(0x1) << US_CR_RCS_Pos)
#define   US_CR_RCS_0_Val                 _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RCS_1_Val                 _U(0x1)   /**< \brief (US_CR) Releases the Slave Select Line NSS (RTS pin) */
#define US_CR_RCS_0                 (US_CR_RCS_0_Val               << US_CR_RCS_Pos)
#define US_CR_RCS_1                 (US_CR_RCS_1_Val               << US_CR_RCS_Pos)
#define US_CR_RTSDIS_Pos            19           /**< \brief (US_CR) Request to Send Disable */
#define US_CR_RTSDIS                (_U(0x1) << US_CR_RTSDIS_Pos)
#define   US_CR_RTSDIS_0_Val              _U(0x0)   /**< \brief (US_CR) No effect */
#define   US_CR_RTSDIS_1_Val              _U(0x1)   /**< \brief (US_CR) Drives the pin RTS to 1 */
#define US_CR_RTSDIS_0              (US_CR_RTSDIS_0_Val            << US_CR_RTSDIS_Pos)
#define US_CR_RTSDIS_1              (US_CR_RTSDIS_1_Val            << US_CR_RTSDIS_Pos)
#define US_CR_LINABT_Pos            20           /**< \brief (US_CR) Abort the current LIN transmission */
#define US_CR_LINABT                (_U(0x1) << US_CR_LINABT_Pos)
#define US_CR_LINWKUP_Pos           21           /**< \brief (US_CR) Sends a wakeup signal on the LIN bus */
#define US_CR_LINWKUP               (_U(0x1) << US_CR_LINWKUP_Pos)
#define US_CR_MASK                  _U(0x003FFFFC) /**< \brief (US_CR) MASK Register */

