frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// Any mode
#define US_MR_MODE_Pos              0            /**< \brief (US_MR) Usart Mode */
#define US_MR_MODE_Msk              (_U(0xF) << US_MR_MODE_Pos)
#define US_MR_MODE(value)           (US_MR_MODE_Msk & ((value) << US_MR_MODE_Pos))
#define   US_MR_MODE_NORMAL_Val           _U(0x0)   /**< \brief (US_MR) Normal */
#define   US_MR_MODE_RS485_Val            _U(0x1)   /**< \brief (US_MR) RS485 */
#define   US_MR_MODE_HARDWARE_Val         _U(0x2)   /**< \brief (US_MR) Hardware Handshaking */
#define   US_MR_MODE_MODEM_Val            _U(0x3)   /**< \brief (US_MR) Modem */
#define   US_MR_MODE_ISO7816_T0_Val       _U(0x4)   /**< \brief (US_MR) IS07816 Protocol: T = 0 */
#define   US_MR_MODE_ISO7816_T1_Val       _U(0x6)   /**< \brief (US_MR) IS07816 Protocol: T = 1 */
#define   US_MR_MODE_IRDA_Val             _U(0x8)   /**< \brief (US_MR) IrDA */
#define   US_MR_MODE_LIN_MASTER_Val       _U(0xA)   /**< \brief (US_MR) LIN Master */
#define   US_MR_MODE_LIN_SLAVE_Val        _U(0xB)   /**< \brief (US_MR) LIN Slave */
#define   US_MR_MODE_SPI_MASTER_Val       _U(0xE)   /**< \brief (US_MR) SPI Master */
#define   US_MR_MODE_SPI_SLAVE_Val        _U(0xF)   /**< \brief (US_MR) SPI Slave */
#define US_MR_MODE_NORMAL           (US_MR_MODE_NORMAL_Val         << US_MR_MODE_Pos)
#define US_MR_MODE_RS485            (US_MR_MODE_RS485_Val          << US_MR_MODE_Pos)
#define US_MR_MODE_HARDWARE         (US_MR_MODE_HARDWARE_Val       << US_MR_MODE_Pos)
#define US_MR_MODE_MODEM            (US_MR_MODE_MODEM_Val          << US_MR_MODE_Pos)
#define US_MR_MODE_ISO7816_T0       (US_MR_MODE_ISO7816_T0_Val     << US_MR_MODE_Pos)
#define US_MR_MODE_ISO7816_T1       (US_MR_MODE_ISO7816_T1_Val     << US_MR_MODE_Pos)
#define US_MR_MODE_IRDA             (US_MR_MODE_IRDA_Val           << US_MR_MODE_Pos)
#define US_MR_MODE_LIN_MASTER       (US_MR_MODE_LIN_MASTER_Val     << US_MR_MODE_Pos)
#define US_MR_MODE_LIN_SLAVE        (US_MR_MODE_LIN_SLAVE_Val      << US_MR_MODE_Pos)
#define US_MR_MODE_SPI_MASTER       (US_MR_MODE_SPI_MASTER_Val     << US_MR_MODE_Pos)
#define US_MR_MODE_SPI_SLAVE        (US_MR_MODE_SPI_SLAVE_Val      << US_MR_MODE_Pos)
#define US_MR_USCLKS_Pos            4            /**< \brief (US_MR) Clock Selection */
#define US_MR_USCLKS_Msk            (_U(0x3) << US_MR_USCLKS_Pos)
#define US_MR_USCLKS(value)         (US_MR_USCLKS_Msk & ((value) << US_MR_USCLKS_Pos))
#define   US_MR_USCLKS_MCK_Val            _U(0x0)   /**< \brief (US_MR) MCK */
#define   US_MR_USCLKS_MCK_DIV_Val        _U(0x1)   /**< \brief (US_MR) MCK / DIV */
#define   US_MR_USCLKS_2_Val              _U(0x2)   /**< \brief (US_MR) Reserved */
#define   US_MR_USCLKS_SCK_Val            _U(0x3)   /**< \brief (US_MR) SCK */
#define US_MR_USCLKS_MCK            (US_MR_USCLKS_MCK_Val          << US_MR_USCLKS_Pos)
#define US_MR_USCLKS_MCK_DIV        (US_MR_USCLKS_MCK_DIV_Val      << US_MR_USCLKS_Pos)
#define US_MR_USCLKS_2              (US_MR_USCLKS_2_Val            << US_MR_USCLKS_Pos)
#define US_MR_USCLKS_SCK            (US_MR_USCLKS_SCK_Val          << US_MR_USCLKS_Pos)
#define US_MR_CHRL_Pos              6            /**< \brief (US_MR) Character Length. */
#define US_MR_CHRL_Msk              (_U(0x3) << US_MR_CHRL_Pos)
#define US_MR_CHRL(value)           (US_MR_CHRL_Msk & ((value) << US_MR_CHRL_Pos))
#define   US_MR_CHRL_5_Val                _U(0x0)   /**< \brief (US_MR) 5 bits */
#define   US_MR_CHRL_6_Val                _U(0x1)   /**< \brief (US_MR) 6 bits */
#define   US_MR_CHRL_7_Val                _U(0x2)   /**< \brief (US_MR) 7 bits */
#define   US_MR_CHRL_8_Val                _U(0x3)   /**< \brief (US_MR) 8 bits */
#define US_MR_CHRL_5                (US_MR_CHRL_5_Val              << US_MR_CHRL_Pos)
#define US_MR_CHRL_6                (US_MR_CHRL_6_Val              << US_MR_CHRL_Pos)
#define US_MR_CHRL_7                (US_MR_CHRL_7_Val              << US_MR_CHRL_Pos)
#define US_MR_CHRL_8                (US_MR_CHRL_8_Val              << US_MR_CHRL_Pos)
#define US_MR_CPHA_Pos              8            /**< \brief (US_MR) SPI CLock Phase */
#define US_MR_CPHA                  (_U(0x1) << US_MR_CPHA_Pos)
#define   US_MR_CPHA_0_Val                _U(0x0)   /**< \brief (US_MR) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK */
#define   US_MR_CPHA_1_Val                _U(0x1)   /**< \brief (US_MR) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK */
#define US_MR_CPHA_0                (US_MR_CPHA_0_Val              << US_MR_CPHA_Pos)
#define US_MR_CPHA_1                (US_MR_CPHA_1_Val              << US_MR_CPHA_Pos)
#define US_MR_SYNC_Pos              8            /**< \brief (US_MR) Synchronous Mode Select */
#define US_MR_SYNC                  (_U(0x1) << US_MR_SYNC_Pos)
#define   US_MR_SYNC_0_Val                _U(0x0)   /**< \brief (US_MR) USART operates in Synchronous Mode */
#define   US_MR_SYNC_1_Val                _U(0x1)   /**< \brief (US_MR) USART operates in Asynchronous Mode */
#define US_MR_SYNC_0                (US_MR_SYNC_0_Val              << US_MR_SYNC_Pos)
#define US_MR_SYNC_1                (US_MR_SYNC_1_Val              << US_MR_SYNC_Pos)
#define US_MR_PAR_Pos               9            /**< \brief (US_MR) Parity Type */
#define US_MR_PAR_Msk               (_U(0x7) << US_MR_PAR_Pos)
#define US_MR_PAR(value)            (US_MR_PAR_Msk & ((value) << US_MR_PAR_Pos))
#define   US_MR_PAR_EVEN_Val              _U(0x0)   /**< \brief (US_MR) Even parity */
#define   US_MR_PAR_ODD_Val               _U(0x1)   /**< \brief (US_MR) Odd parity */
#define   US_MR_PAR_SPACE_Val             _U(0x2)   /**< \brief (US_MR) Parity forced to 0 (Space) */
#define   US_MR_PAR_MARK_Val              _U(0x3)   /**< \brief (US_MR) Parity forced to 1 (Mark) */
#define   US_MR_PAR_NONE_Val              _U(0x4)   /**< \brief (US_MR) No Parity */
#define   US_MR_PAR_5_Val                 _U(0x5)   /**< \brief (US_MR) No Parity */
#define   US_MR_PAR_MULTI_Val             _U(0x6)   /**< \brief (US_MR) Multi-drop mode */
#define   US_MR_PAR_7_Val                 _U(0x7)   /**< \brief (US_MR) Multi-drop mode */
#define US_MR_PAR_EVEN              (US_MR_PAR_EVEN_Val            << US_MR_PAR_Pos)
#define US_MR_PAR_ODD               (US_MR_PAR_ODD_Val             << US_MR_PAR_Pos)
#define US_MR_PAR_SPACE             (US_MR_PAR_SPACE_Val           << US_MR_PAR_Pos)
#define US_MR_PAR_MARK              (US_MR_PAR_MARK_Val            << US_MR_PAR_Pos)
#define US_MR_PAR_NONE              (US_MR_PAR_NONE_Val            << US_MR_PAR_Pos)
#define US_MR_PAR_5                 (US_MR_PAR_5_Val               << US_MR_PAR_Pos)
#define US_MR_PAR_MULTI             (US_MR_PAR_MULTI_Val           << US_MR_PAR_Pos)
#define US_MR_PAR_7                 (US_MR_PAR_7_Val               << US_MR_PAR_Pos)
#define US_MR_NBSTOP_Pos            12           /**< \brief (US_MR) Number of Stop Bits */
#define US_MR_NBSTOP_Msk            (_U(0x3) << US_MR_NBSTOP_Pos)
#define US_MR_NBSTOP(value)         (US_MR_NBSTOP_Msk & ((value) << US_MR_NBSTOP_Pos))
#define   US_MR_NBSTOP_1_Val              _U(0x0)   /**< \brief (US_MR) 1 stop bit */
#define   US_MR_NBSTOP_1_5_Val            _U(0x1)   /**< \brief (US_MR) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_MR_NBSTOP_2_Val              _U(0x2)   /**< \brief (US_MR) 2 stop bits */
#define   US_MR_NBSTOP_3_Val              _U(0x3)   /**< \brief (US_MR) Reserved */
#define US_MR_NBSTOP_1              (US_MR_NBSTOP_1_Val            << US_MR_NBSTOP_Pos)
#define US_MR_NBSTOP_1_5            (US_MR_NBSTOP_1_5_Val          << US_MR_NBSTOP_Pos)
#define US_MR_NBSTOP_2              (US_MR_NBSTOP_2_Val            << US_MR_NBSTOP_Pos)
#define US_MR_NBSTOP_3              (US_MR_NBSTOP_3_Val            << US_MR_NBSTOP_Pos)
#define US_MR_CHMODE_Pos            14           /**< \brief (US_MR) Channel Mode */
#define US_MR_CHMODE_Msk            (_U(0x3) << US_MR_CHMODE_Pos)
#define US_MR_CHMODE(value)         (US_MR_CHMODE_Msk & ((value) << US_MR_CHMODE_Pos))
#define   US_MR_CHMODE_NORMAL_Val         _U(0x0)   /**< \brief (US_MR) Normal Mode */
#define   US_MR_CHMODE_ECHO_Val           _U(0x1)   /**< \brief (US_MR) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_MR_CHMODE_LOCAL_LOOP_Val     _U(0x2)   /**< \brief (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_MR_CHMODE_REMOTE_LOOP_Val    _U(0x3)   /**< \brief (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_MR_CHMODE_NORMAL         (US_MR_CHMODE_NORMAL_Val       << US_MR_CHMODE_Pos)
#define US_MR_CHMODE_ECHO           (US_MR_CHMODE_ECHO_Val         << US_MR_CHMODE_Pos)
#define US_MR_CHMODE_LOCAL_LOOP     (US_MR_CHMODE_LOCAL_LOOP_Val   << US_MR_CHMODE_Pos)
#define US_MR_CHMODE_REMOTE_LOOP    (US_MR_CHMODE_REMOTE_LOOP_Val  << US_MR_CHMODE_Pos)
#define US_MR_CPOL_Pos              16           /**< \brief (US_MR) SPI Clock Polarity */
#define US_MR_CPOL                  (_U(0x1) << US_MR_CPOL_Pos)
#define   US_MR_CPOL_ZERO_Val             _U(0x0)   /**< \brief (US_MR) The inactive state value of SPCK is logic level zero */
#define   US_MR_CPOL_ONE_Val              _U(0x1)   /**< \brief (US_MR) The inactive state value of SPCK is logic level one */
#define US_MR_CPOL_ZERO             (US_MR_CPOL_ZERO_Val           << US_MR_CPOL_Pos)
#define US_MR_CPOL_ONE              (US_MR_CPOL_ONE_Val            << US_MR_CPOL_Pos)
#define US_MR_MSBF_Pos              16           /**< \brief (US_MR) Bit Order */
#define US_MR_MSBF                  (_U(0x1) << US_MR_MSBF_Pos)
#define   US_MR_MSBF_LSBF_Val             _U(0x0)   /**< \brief (US_MR) Least Significant Bit first */
#define   US_MR_MSBF_MSBF_Val             _U(0x1)   /**< \brief (US_MR) Most Significant Bit first */
#define US_MR_MSBF_LSBF             (US_MR_MSBF_LSBF_Val           << US_MR_MSBF_Pos)
#define US_MR_MSBF_MSBF             (US_MR_MSBF_MSBF_Val           << US_MR_MSBF_Pos)
#define US_MR_MODE9_Pos             17           /**< \brief (US_MR) 9-bit Character Length */
#define US_MR_MODE9                 (_U(0x1) << US_MR_MODE9_Pos)
#define   US_MR_MODE9_0_Val               _U(0x0)   /**< \brief (US_MR) CHRL defines character length */
#define   US_MR_MODE9_1_Val               _U(0x1)   /**< \brief (US_MR) 9-bit character length */
#define US_MR_MODE9_0               (US_MR_MODE9_0_Val             << US_MR_MODE9_Pos)
#define US_MR_MODE9_1               (US_MR_MODE9_1_Val             << US_MR_MODE9_Pos)
#define US_MR_CLKO_Pos              18           /**< \brief (US_MR) Clock Output Select */
#define US_MR_CLKO                  (_U(0x1) << US_MR_CLKO_Pos)
#define   US_MR_CLKO_0_Val                _U(0x0)   /**< \brief (US_MR) The USART does not drive the SCK pin */
#define   US_MR_CLKO_1_Val                _U(0x1)   /**< \brief (US_MR) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_MR_CLKO_0                (US_MR_CLKO_0_Val              << US_MR_CLKO_Pos)
#define US_MR_CLKO_1                (US_MR_CLKO_1_Val              << US_MR_CLKO_Pos)
#define US_MR_OVER_Pos              19           /**< \brief (US_MR) Oversampling Mode */
#define US_MR_OVER                  (_U(0x1) << US_MR_OVER_Pos)
#define   US_MR_OVER_X16_Val              _U(0x0)   /**< \brief (US_MR) 16x Oversampling */
#define   US_MR_OVER_X8_Val               _U(0x1)   /**< \brief (US_MR) 8x Oversampling */
#define US_MR_OVER_X16              (US_MR_OVER_X16_Val            << US_MR_OVER_Pos)
#define US_MR_OVER_X8               (US_MR_OVER_X8_Val             << US_MR_OVER_Pos)
#define US_MR_INACK_Pos             20           /**< \brief (US_MR) Inhibit Non Acknowledge */
#define US_MR_INACK                 (_U(0x1) << US_MR_INACK_Pos)
#define   US_MR_INACK_0_Val               _U(0x0)   /**< \brief (US_MR) The NACK is generated */
#define   US_MR_INACK_1_Val               _U(0x1)   /**< \brief (US_MR) The NACK is not generated */
#define US_MR_INACK_0               (US_MR_INACK_0_Val             << US_MR_INACK_Pos)
#define US_MR_INACK_1               (US_MR_INACK_1_Val             << US_MR_INACK_Pos)
#define US_MR_DSNACK_Pos            21           /**< \brief (US_MR) Disable Successive NACK */
#define US_MR_DSNACK                (_U(0x1) << US_MR_DSNACK_Pos)
#define   US_MR_DSNACK_0_Val              _U(0x0)   /**< \brief (US_MR) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_MR_DSNACK_1_Val              _U(0x1)   /**< \brief (US_MR) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_MR_DSNACK_0              (US_MR_DSNACK_0_Val            << US_MR_DSNACK_Pos)
#define US_MR_DSNACK_1              (US_MR_DSNACK_1_Val            << US_MR_DSNACK_Pos)
#define US_MR_VAR_SYNC_Pos          22           /**< \brief (US_MR) Variable synchronization of command/data sync Start Frame Delimiter */
#define US_MR_VAR_SYNC              (_U(0x1) << US_MR_VAR_SYNC_Pos)
#define   US_MR_VAR_SYNC_0_Val            _U(0x0)   /**< \brief (US_MR) User defined configuration of command or data sync field depending on SYNC value */
#define   US_MR_VAR_SYNC_1_Val            _U(0x1)   /**< \brief (US_MR) The sync field is updated when a character is written into THR register */
#define US_MR_VAR_SYNC_0            (US_MR_VAR_SYNC_0_Val          << US_MR_VAR_SYNC_Pos)
#define US_MR_VAR_SYNC_1            (US_MR_VAR_SYNC_1_Val          << US_MR_VAR_SYNC_Pos)
#define US_MR_INVDATA_Pos           23           /**< \brief (US_MR) Inverted data */
#define US_MR_INVDATA               (_U(0x1) << US_MR_INVDATA_Pos)
#define US_MR_MAX_ITERATION_Pos     24           /**< \brief (US_MR) Max interation */
#define US_MR_MAX_ITERATION_Msk     (_U(0x7) << US_MR_MAX_ITERATION_Pos)
#define US_MR_MAX_ITERATION(value)  (US_MR_MAX_ITERATION_Msk & ((value) << US_MR_MAX_ITERATION_Pos))
#define US_MR_FILTER_Pos            28           /**< \brief (US_MR) Infrared Receive Line Filter */
#define US_MR_FILTER                (_U(0x1) << US_MR_FILTER_Pos)
#define   US_MR_FILTER_0_Val              _U(0x0)   /**< \brief (US_MR) The USART does not filter the receive line */
#define   US_MR_FILTER_1_Val              _U(0x1)   /**< \brief (US_MR) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
#define US_MR_FILTER_0              (US_MR_FILTER_0_Val            << US_MR_FILTER_Pos)
#define US_MR_FILTER_1              (US_MR_FILTER_1_Val            << US_MR_FILTER_Pos)
#define US_MR_MAN_Pos               29           /**< \brief (US_MR) Manchester Encoder/Decoder Enable */
#define US_MR_MAN                   (_U(0x1) << US_MR_MAN_Pos)
#define   US_MR_MAN_0_Val                 _U(0x0)   /**< \brief (US_MR) Manchester Encoder/Decoder is disabled */
#define   US_MR_MAN_1_Val                 _U(0x1)   /**< \brief (US_MR) Manchester Encoder/Decoder is enabled */
#define US_MR_MAN_0                 (US_MR_MAN_0_Val               << US_MR_MAN_Pos)
#define US_MR_MAN_1                 (US_MR_MAN_1_Val               << US_MR_MAN_Pos)
#define US_MR_MODSYNC_Pos           30           /**< \brief (US_MR) Manchester Synchronization Mode */
#define US_MR_MODSYNC               (_U(0x1) << US_MR_MODSYNC_Pos)
#define   US_MR_MODSYNC_0_Val             _U(0x0)   /**< \brief (US_MR) The Manchester Start bit is a 0 to 1 transition */
#define   US_MR_MODSYNC_1_Val             _U(0x1)   /**< \brief (US_MR) The Manchester Start bit is a 1 to 0 transition */
#define US_MR_MODSYNC_0             (US_MR_MODSYNC_0_Val           << US_MR_MODSYNC_Pos)
#define US_MR_MODSYNC_1             (US_MR_MODSYNC_1_Val           << US_MR_MODSYNC_Pos)
#define US_MR_ONEBIT_Pos            31           /**< \brief (US_MR) Start Frame Delimiter selector */
#define US_MR_ONEBIT                (_U(0x1) << US_MR_ONEBIT_Pos)
#define   US_MR_ONEBIT_0_Val              _U(0x0)   /**< \brief (US_MR) Start Frame delimiter is COMMAND or DATA SYNC */
#define   US_MR_ONEBIT_1_Val              _U(0x1)   /**< \brief (US_MR) Start Frame delimiter is One Bit */
#define US_MR_ONEBIT_0              (US_MR_ONEBIT_0_Val            << US_MR_ONEBIT_Pos)
#define US_MR_ONEBIT_1              (US_MR_ONEBIT_1_Val            << US_MR_ONEBIT_Pos)
#define US_MR_MASK                  _U(0xF7FFFFFF) /**< \brief (US_MR) MASK Register */

