frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// LIN mode
#define US_IER_LIN_RXRDY_Pos        0            /**< \brief (US_IER_LIN) Receiver Ready Interrupt Enable */
#define US_IER_LIN_RXRDY            (_U(0x1) << US_IER_LIN_RXRDY_Pos)
#define   US_IER_LIN_RXRDY_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_RXRDY_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_RXRDY_0          (US_IER_LIN_RXRDY_0_Val        << US_IER_LIN_RXRDY_Pos)
#define US_IER_LIN_RXRDY_1          (US_IER_LIN_RXRDY_1_Val        << US_IER_LIN_RXRDY_Pos)
#define US_IER_LIN_TXRDY_Pos        1            /**< \brief (US_IER_LIN) Transmitter Ready Interrupt Enable */
#define US_IER_LIN_TXRDY            (_U(0x1) << US_IER_LIN_TXRDY_Pos)
#define   US_IER_LIN_TXRDY_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_TXRDY_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_TXRDY_0          (US_IER_LIN_TXRDY_0_Val        << US_IER_LIN_TXRDY_Pos)
#define US_IER_LIN_TXRDY_1          (US_IER_LIN_TXRDY_1_Val        << US_IER_LIN_TXRDY_Pos)
#define US_IER_LIN_RXBRK_Pos        2            /**< \brief (US_IER_LIN) Receiver Break Interrupt Enable */
#define US_IER_LIN_RXBRK            (_U(0x1) << US_IER_LIN_RXBRK_Pos)
#define   US_IER_LIN_RXBRK_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_RXBRK_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_RXBRK_0          (US_IER_LIN_RXBRK_0_Val        << US_IER_LIN_RXBRK_Pos)
#define US_IER_LIN_RXBRK_1          (US_IER_LIN_RXBRK_1_Val        << US_IER_LIN_RXBRK_Pos)
#define US_IER_LIN_OVRE_Pos         5            /**< \brief (US_IER_LIN) Overrun Error Interrupt Enable */
#define US_IER_LIN_OVRE             (_U(0x1) << US_IER_LIN_OVRE_Pos)
#define   US_IER_LIN_OVRE_0_Val           _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_OVRE_1_Val           _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_OVRE_0           (US_IER_LIN_OVRE_0_Val         << US_IER_LIN_OVRE_Pos)
#define US_IER_LIN_OVRE_1           (US_IER_LIN_OVRE_1_Val         << US_IER_LIN_OVRE_Pos)
#define US_IER_LIN_FRAME_Pos        6            /**< \brief (US_IER_LIN) Framing Error Interrupt Enable */
#define US_IER_LIN_FRAME            (_U(0x1) << US_IER_LIN_FRAME_Pos)
#define   US_IER_LIN_FRAME_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_FRAME_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_FRAME_0          (US_IER_LIN_FRAME_0_Val        << US_IER_LIN_FRAME_Pos)
#define US_IER_LIN_FRAME_1          (US_IER_LIN_FRAME_1_Val        << US_IER_LIN_FRAME_Pos)
#define US_IER_LIN_PARE_Pos         7            /**< \brief (US_IER_LIN) Parity Error Interrupt Enable */
#define US_IER_LIN_PARE             (_U(0x1) << US_IER_LIN_PARE_Pos)
#define   US_IER_LIN_PARE_0_Val           _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_PARE_1_Val           _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_PARE_0           (US_IER_LIN_PARE_0_Val         << US_IER_LIN_PARE_Pos)
#define US_IER_LIN_PARE_1           (US_IER_LIN_PARE_1_Val         << US_IER_LIN_PARE_Pos)
#define US_IER_LIN_TIMEOUT_Pos      8            /**< \brief (US_IER_LIN) Time-out Interrupt Enable */
#define US_IER_LIN_TIMEOUT          (_U(0x1) << US_IER_LIN_TIMEOUT_Pos)
#define   US_IER_LIN_TIMEOUT_0_Val        _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_TIMEOUT_1_Val        _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_TIMEOUT_0        (US_IER_LIN_TIMEOUT_0_Val      << US_IER_LIN_TIMEOUT_Pos)
#define US_IER_LIN_TIMEOUT_1        (US_IER_LIN_TIMEOUT_1_Val      << US_IER_LIN_TIMEOUT_Pos)
#define US_IER_LIN_TXEMPTY_Pos      9            /**< \brief (US_IER_LIN) Transmitter Empty Interrupt Enable */
#define US_IER_LIN_TXEMPTY          (_U(0x1) << US_IER_LIN_TXEMPTY_Pos)
#define   US_IER_LIN_TXEMPTY_0_Val        _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_TXEMPTY_1_Val        _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_TXEMPTY_0        (US_IER_LIN_TXEMPTY_0_Val      << US_IER_LIN_TXEMPTY_Pos)
#define US_IER_LIN_TXEMPTY_1        (US_IER_LIN_TXEMPTY_1_Val      << US_IER_LIN_TXEMPTY_Pos)
#define US_IER_LIN_ITER_Pos         10           /**< \brief (US_IER_LIN) Iteration Interrupt Enable */
#define US_IER_LIN_ITER             (_U(0x1) << US_IER_LIN_ITER_Pos)
#define   US_IER_LIN_ITER_0_Val           _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_ITER_1_Val           _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_ITER_0           (US_IER_LIN_ITER_0_Val         << US_IER_LIN_ITER_Pos)
#define US_IER_LIN_ITER_1           (US_IER_LIN_ITER_1_Val         << US_IER_LIN_ITER_Pos)
#define US_IER_LIN_TXBUFE_Pos       11           /**< \brief (US_IER_LIN) Buffer Empty Interrupt Enable */
#define US_IER_LIN_TXBUFE           (_U(0x1) << US_IER_LIN_TXBUFE_Pos)
#define   US_IER_LIN_TXBUFE_0_Val         _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_TXBUFE_1_Val         _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_TXBUFE_0         (US_IER_LIN_TXBUFE_0_Val       << US_IER_LIN_TXBUFE_Pos)
#define US_IER_LIN_TXBUFE_1         (US_IER_LIN_TXBUFE_1_Val       << US_IER_LIN_TXBUFE_Pos)
#define US_IER_LIN_RXBUFF_Pos       12           /**< \brief (US_IER_LIN) Buffer Full Interrupt Enable */
#define US_IER_LIN_RXBUFF           (_U(0x1) << US_IER_LIN_RXBUFF_Pos)
#define   US_IER_LIN_RXBUFF_0_Val         _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_RXBUFF_1_Val         _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_RXBUFF_0         (US_IER_LIN_RXBUFF_0_Val       << US_IER_LIN_RXBUFF_Pos)
#define US_IER_LIN_RXBUFF_1         (US_IER_LIN_RXBUFF_1_Val       << US_IER_LIN_RXBUFF_Pos)
#define US_IER_LIN_NACK_Pos         13           /**< \brief (US_IER_LIN) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Enable */
#define US_IER_LIN_NACK             (_U(0x1) << US_IER_LIN_NACK_Pos)
#define   US_IER_LIN_NACK_0_Val           _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_NACK_1_Val           _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_NACK_0           (US_IER_LIN_NACK_0_Val         << US_IER_LIN_NACK_Pos)
#define US_IER_LIN_NACK_1           (US_IER_LIN_NACK_1_Val         << US_IER_LIN_NACK_Pos)
#define US_IER_LIN_LINID_Pos        14           /**< \brief (US_IER_LIN) LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
#define US_IER_LIN_LINID            (_U(0x1) << US_IER_LIN_LINID_Pos)
#define US_IER_LIN_LINTC_Pos        15           /**< \brief (US_IER_LIN) LIN Transfer Conpleted Interrupt Enable */
#define US_IER_LIN_LINTC            (_U(0x1) << US_IER_LIN_LINTC_Pos)
#define US_IER_LIN_RIIC_Pos         16           /**< \brief (US_IER_LIN) Ring Indicator Input Change Enable */
#define US_IER_LIN_RIIC             (_U(0x1) << US_IER_LIN_RIIC_Pos)
#define   US_IER_LIN_RIIC_0_Val           _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_RIIC_1_Val           _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_RIIC_0           (US_IER_LIN_RIIC_0_Val         << US_IER_LIN_RIIC_Pos)
#define US_IER_LIN_RIIC_1           (US_IER_LIN_RIIC_1_Val         << US_IER_LIN_RIIC_Pos)
#define US_IER_LIN_DSRIC_Pos        17           /**< \brief (US_IER_LIN) Data Set Ready Input Change Enable */
#define US_IER_LIN_DSRIC            (_U(0x1) << US_IER_LIN_DSRIC_Pos)
#define   US_IER_LIN_DSRIC_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_DSRIC_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_DSRIC_0          (US_IER_LIN_DSRIC_0_Val        << US_IER_LIN_DSRIC_Pos)
#define US_IER_LIN_DSRIC_1          (US_IER_LIN_DSRIC_1_Val        << US_IER_LIN_DSRIC_Pos)
#define US_IER_LIN_DCDIC_Pos        18           /**< \brief (US_IER_LIN) Data Carrier Detect Input Change Interrupt Enable */
#define US_IER_LIN_DCDIC            (_U(0x1) << US_IER_LIN_DCDIC_Pos)
#define   US_IER_LIN_DCDIC_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_DCDIC_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_DCDIC_0          (US_IER_LIN_DCDIC_0_Val        << US_IER_LIN_DCDIC_Pos)
#define US_IER_LIN_DCDIC_1          (US_IER_LIN_DCDIC_1_Val        << US_IER_LIN_DCDIC_Pos)
#define US_IER_LIN_CTSIC_Pos        19           /**< \brief (US_IER_LIN) Clear to Send Input Change Interrupt Enable */
#define US_IER_LIN_CTSIC            (_U(0x1) << US_IER_LIN_CTSIC_Pos)
#define   US_IER_LIN_CTSIC_0_Val          _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_CTSIC_1_Val          _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_CTSIC_0          (US_IER_LIN_CTSIC_0_Val        << US_IER_LIN_CTSIC_Pos)
#define US_IER_LIN_CTSIC_1          (US_IER_LIN_CTSIC_1_Val        << US_IER_LIN_CTSIC_Pos)
#define US_IER_LIN_LINBE_Pos        25           /**< \brief (US_IER_LIN) LIN Bus Error Interrupt Enable */
#define US_IER_LIN_LINBE            (_U(0x1) << US_IER_LIN_LINBE_Pos)
#define US_IER_LIN_LINISFE_Pos      26           /**< \brief (US_IER_LIN) LIN Inconsistent Synch Field Error Interrupt Enable */
#define US_IER_LIN_LINISFE          (_U(0x1) << US_IER_LIN_LINISFE_Pos)
#define US_IER_LIN_LINIPE_Pos       27           /**< \brief (US_IER_LIN) LIN Identifier Parity Interrupt Enable */
#define US_IER_LIN_LINIPE           (_U(0x1) << US_IER_LIN_LINIPE_Pos)
#define US_IER_LIN_LINCE_Pos        28           /**< \brief (US_IER_LIN) LIN Checksum Error Interrupt Enable */
#define US_IER_LIN_LINCE            (_U(0x1) << US_IER_LIN_LINCE_Pos)
#define US_IER_LIN_LINSNRE_Pos      29           /**< \brief (US_IER_LIN) LIN Slave Not Responding Error Interrupt Enable */
#define US_IER_LIN_LINSNRE          (_U(0x1) << US_IER_LIN_LINSNRE_Pos)
#define US_IER_LIN_LINSTE_Pos       30           /**< \brief (US_IER_LIN) LIN Synch Tolerance Error Interrupt Enable */
#define US_IER_LIN_LINSTE           (_U(0x1) << US_IER_LIN_LINSTE_Pos)
#define   US_IER_LIN_LINSTE_0_Val         _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_LINSTE_1_Val         _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_LINSTE_0         (US_IER_LIN_LINSTE_0_Val       << US_IER_LIN_LINSTE_Pos)
#define US_IER_LIN_LINSTE_1         (US_IER_LIN_LINSTE_1_Val       << US_IER_LIN_LINSTE_Pos)
#define US_IER_LIN_LINHTE_Pos       31           /**< \brief (US_IER_LIN) LIN Header Timeout Error Interrupt Enable */
#define US_IER_LIN_LINHTE           (_U(0x1) << US_IER_LIN_LINHTE_Pos)
#define   US_IER_LIN_LINHTE_0_Val         _U(0x0)   /**< \brief (US_IER_LIN) No Effect */
#define   US_IER_LIN_LINHTE_1_Val         _U(0x1)   /**< \brief (US_IER_LIN) Enables the interrupt */
#define US_IER_LIN_LINHTE_0         (US_IER_LIN_LINHTE_0_Val       << US_IER_LIN_LINHTE_Pos)
#define US_IER_LIN_LINHTE_1         (US_IER_LIN_LINHTE_1_Val       << US_IER_LIN_LINHTE_Pos)
#define US_IER_LIN_MASK             _U(0xFE0FFFE7) /**< \brief (US_IER_LIN) MASK Register */

// SPI_SLAVE mode
#define US_IER_SPI_SLAVE_RXRDY_Pos  0            /**< \brief (US_IER_SPI_SLAVE) Receiver Ready Interrupt Enable */
#define US_IER_SPI_SLAVE_RXRDY      (_U(0x1) << US_IER_SPI_SLAVE_RXRDY_Pos)
#define   US_IER_SPI_SLAVE_RXRDY_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_RXRDY_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_RXRDY_0    (US_IER_SPI_SLAVE_RXRDY_0_Val  << US_IER_SPI_SLAVE_RXRDY_Pos)
#define US_IER_SPI_SLAVE_RXRDY_1    (US_IER_SPI_SLAVE_RXRDY_1_Val  << US_IER_SPI_SLAVE_RXRDY_Pos)
#define US_IER_SPI_SLAVE_TXRDY_Pos  1            /**< \brief (US_IER_SPI_SLAVE) Transmitter Ready Interrupt Enable */
#define US_IER_SPI_SLAVE_TXRDY      (_U(0x1) << US_IER_SPI_SLAVE_TXRDY_Pos)
#define   US_IER_SPI_SLAVE_TXRDY_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_TXRDY_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_TXRDY_0    (US_IER_SPI_SLAVE_TXRDY_0_Val  << US_IER_SPI_SLAVE_TXRDY_Pos)
#define US_IER_SPI_SLAVE_TXRDY_1    (US_IER_SPI_SLAVE_TXRDY_1_Val  << US_IER_SPI_SLAVE_TXRDY_Pos)
#define US_IER_SPI_SLAVE_RXBRK_Pos  2            /**< \brief (US_IER_SPI_SLAVE) Receiver Break Interrupt Enable */
#define US_IER_SPI_SLAVE_RXBRK      (_U(0x1) << US_IER_SPI_SLAVE_RXBRK_Pos)
#define   US_IER_SPI_SLAVE_RXBRK_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_RXBRK_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_RXBRK_0    (US_IER_SPI_SLAVE_RXBRK_0_Val  << US_IER_SPI_SLAVE_RXBRK_Pos)
#define US_IER_SPI_SLAVE_RXBRK_1    (US_IER_SPI_SLAVE_RXBRK_1_Val  << US_IER_SPI_SLAVE_RXBRK_Pos)
#define US_IER_SPI_SLAVE_OVRE_Pos   5            /**< \brief (US_IER_SPI_SLAVE) Overrun Error Interrupt Enable */
#define US_IER_SPI_SLAVE_OVRE       (_U(0x1) << US_IER_SPI_SLAVE_OVRE_Pos)
#define   US_IER_SPI_SLAVE_OVRE_0_Val     _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_OVRE_1_Val     _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_OVRE_0     (US_IER_SPI_SLAVE_OVRE_0_Val   << US_IER_SPI_SLAVE_OVRE_Pos)
#define US_IER_SPI_SLAVE_OVRE_1     (US_IER_SPI_SLAVE_OVRE_1_Val   << US_IER_SPI_SLAVE_OVRE_Pos)
#define US_IER_SPI_SLAVE_FRAME_Pos  6            /**< \brief (US_IER_SPI_SLAVE) Framing Error Interrupt Enable */
#define US_IER_SPI_SLAVE_FRAME      (_U(0x1) << US_IER_SPI_SLAVE_FRAME_Pos)
#define   US_IER_SPI_SLAVE_FRAME_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_FRAME_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_FRAME_0    (US_IER_SPI_SLAVE_FRAME_0_Val  << US_IER_SPI_SLAVE_FRAME_Pos)
#define US_IER_SPI_SLAVE_FRAME_1    (US_IER_SPI_SLAVE_FRAME_1_Val  << US_IER_SPI_SLAVE_FRAME_Pos)
#define US_IER_SPI_SLAVE_PARE_Pos   7            /**< \brief (US_IER_SPI_SLAVE) Parity Error Interrupt Enable */
#define US_IER_SPI_SLAVE_PARE       (_U(0x1) << US_IER_SPI_SLAVE_PARE_Pos)
#define   US_IER_SPI_SLAVE_PARE_0_Val     _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_PARE_1_Val     _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_PARE_0     (US_IER_SPI_SLAVE_PARE_0_Val   << US_IER_SPI_SLAVE_PARE_Pos)
#define US_IER_SPI_SLAVE_PARE_1     (US_IER_SPI_SLAVE_PARE_1_Val   << US_IER_SPI_SLAVE_PARE_Pos)
#define US_IER_SPI_SLAVE_TIMEOUT_Pos 8            /**< \brief (US_IER_SPI_SLAVE) Time-out Interrupt Enable */
#define US_IER_SPI_SLAVE_TIMEOUT    (_U(0x1) << US_IER_SPI_SLAVE_TIMEOUT_Pos)
#define   US_IER_SPI_SLAVE_TIMEOUT_0_Val  _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_TIMEOUT_1_Val  _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_TIMEOUT_0  (US_IER_SPI_SLAVE_TIMEOUT_0_Val << US_IER_SPI_SLAVE_TIMEOUT_Pos)
#define US_IER_SPI_SLAVE_TIMEOUT_1  (US_IER_SPI_SLAVE_TIMEOUT_1_Val << US_IER_SPI_SLAVE_TIMEOUT_Pos)
#define US_IER_SPI_SLAVE_TXEMPTY_Pos 9            /**< \brief (US_IER_SPI_SLAVE) Transmitter Empty Interrupt Enable */
#define US_IER_SPI_SLAVE_TXEMPTY    (_U(0x1) << US_IER_SPI_SLAVE_TXEMPTY_Pos)
#define   US_IER_SPI_SLAVE_TXEMPTY_0_Val  _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_TXEMPTY_1_Val  _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_TXEMPTY_0  (US_IER_SPI_SLAVE_TXEMPTY_0_Val << US_IER_SPI_SLAVE_TXEMPTY_Pos)
#define US_IER_SPI_SLAVE_TXEMPTY_1  (US_IER_SPI_SLAVE_TXEMPTY_1_Val << US_IER_SPI_SLAVE_TXEMPTY_Pos)
#define US_IER_SPI_SLAVE_UNRE_Pos   10           /**< \brief (US_IER_SPI_SLAVE) SPI Underrun Error Interrupt Enable */
#define US_IER_SPI_SLAVE_UNRE       (_U(0x1) << US_IER_SPI_SLAVE_UNRE_Pos)
#define   US_IER_SPI_SLAVE_UNRE_0_Val     _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_UNRE_1_Val     _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_UNRE_0     (US_IER_SPI_SLAVE_UNRE_0_Val   << US_IER_SPI_SLAVE_UNRE_Pos)
#define US_IER_SPI_SLAVE_UNRE_1     (US_IER_SPI_SLAVE_UNRE_1_Val   << US_IER_SPI_SLAVE_UNRE_Pos)
#define US_IER_SPI_SLAVE_TXBUFE_Pos 11           /**< \brief (US_IER_SPI_SLAVE) Buffer Empty Interrupt Enable */
#define US_IER_SPI_SLAVE_TXBUFE     (_U(0x1) << US_IER_SPI_SLAVE_TXBUFE_Pos)
#define   US_IER_SPI_SLAVE_TXBUFE_0_Val   _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_TXBUFE_1_Val   _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_TXBUFE_0   (US_IER_SPI_SLAVE_TXBUFE_0_Val << US_IER_SPI_SLAVE_TXBUFE_Pos)
#define US_IER_SPI_SLAVE_TXBUFE_1   (US_IER_SPI_SLAVE_TXBUFE_1_Val << US_IER_SPI_SLAVE_TXBUFE_Pos)
#define US_IER_SPI_SLAVE_RXBUFF_Pos 12           /**< \brief (US_IER_SPI_SLAVE) Buffer Full Interrupt Enable */
#define US_IER_SPI_SLAVE_RXBUFF     (_U(0x1) << US_IER_SPI_SLAVE_RXBUFF_Pos)
#define   US_IER_SPI_SLAVE_RXBUFF_0_Val   _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_RXBUFF_1_Val   _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_RXBUFF_0   (US_IER_SPI_SLAVE_RXBUFF_0_Val << US_IER_SPI_SLAVE_RXBUFF_Pos)
#define US_IER_SPI_SLAVE_RXBUFF_1   (US_IER_SPI_SLAVE_RXBUFF_1_Val << US_IER_SPI_SLAVE_RXBUFF_Pos)
#define US_IER_SPI_SLAVE_NACK_Pos   13           /**< \brief (US_IER_SPI_SLAVE) Non Acknowledge Interrupt Enable */
#define US_IER_SPI_SLAVE_NACK       (_U(0x1) << US_IER_SPI_SLAVE_NACK_Pos)
#define   US_IER_SPI_SLAVE_NACK_0_Val     _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_NACK_1_Val     _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_NACK_0     (US_IER_SPI_SLAVE_NACK_0_Val   << US_IER_SPI_SLAVE_NACK_Pos)
#define US_IER_SPI_SLAVE_NACK_1     (US_IER_SPI_SLAVE_NACK_1_Val   << US_IER_SPI_SLAVE_NACK_Pos)
#define US_IER_SPI_SLAVE_RIIC_Pos   16           /**< \brief (US_IER_SPI_SLAVE) Ring Indicator Input Change Enable */
#define US_IER_SPI_SLAVE_RIIC       (_U(0x1) << US_IER_SPI_SLAVE_RIIC_Pos)
#define   US_IER_SPI_SLAVE_RIIC_0_Val     _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_RIIC_1_Val     _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_RIIC_0     (US_IER_SPI_SLAVE_RIIC_0_Val   << US_IER_SPI_SLAVE_RIIC_Pos)
#define US_IER_SPI_SLAVE_RIIC_1     (US_IER_SPI_SLAVE_RIIC_1_Val   << US_IER_SPI_SLAVE_RIIC_Pos)
#define US_IER_SPI_SLAVE_DSRIC_Pos  17           /**< \brief (US_IER_SPI_SLAVE) Data Set Ready Input Change Enable */
#define US_IER_SPI_SLAVE_DSRIC      (_U(0x1) << US_IER_SPI_SLAVE_DSRIC_Pos)
#define   US_IER_SPI_SLAVE_DSRIC_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_DSRIC_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_DSRIC_0    (US_IER_SPI_SLAVE_DSRIC_0_Val  << US_IER_SPI_SLAVE_DSRIC_Pos)
#define US_IER_SPI_SLAVE_DSRIC_1    (US_IER_SPI_SLAVE_DSRIC_1_Val  << US_IER_SPI_SLAVE_DSRIC_Pos)
#define US_IER_SPI_SLAVE_DCDIC_Pos  18           /**< \brief (US_IER_SPI_SLAVE) Data Carrier Detect Input Change Interrupt Enable */
#define US_IER_SPI_SLAVE_DCDIC      (_U(0x1) << US_IER_SPI_SLAVE_DCDIC_Pos)
#define   US_IER_SPI_SLAVE_DCDIC_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_DCDIC_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_DCDIC_0    (US_IER_SPI_SLAVE_DCDIC_0_Val  << US_IER_SPI_SLAVE_DCDIC_Pos)
#define US_IER_SPI_SLAVE_DCDIC_1    (US_IER_SPI_SLAVE_DCDIC_1_Val  << US_IER_SPI_SLAVE_DCDIC_Pos)
#define US_IER_SPI_SLAVE_CTSIC_Pos  19           /**< \brief (US_IER_SPI_SLAVE) Clear to Send Input Change Interrupt Enable */
#define US_IER_SPI_SLAVE_CTSIC      (_U(0x1) << US_IER_SPI_SLAVE_CTSIC_Pos)
#define   US_IER_SPI_SLAVE_CTSIC_0_Val    _U(0x0)   /**< \brief (US_IER_SPI_SLAVE) No Effect */
#define   US_IER_SPI_SLAVE_CTSIC_1_Val    _U(0x1)   /**< \brief (US_IER_SPI_SLAVE) Enables the interrupt */
#define US_IER_SPI_SLAVE_CTSIC_0    (US_IER_SPI_SLAVE_CTSIC_0_Val  << US_IER_SPI_SLAVE_CTSIC_Pos)
#define US_IER_SPI_SLAVE_CTSIC_1    (US_IER_SPI_SLAVE_CTSIC_1_Val  << US_IER_SPI_SLAVE_CTSIC_Pos)
#define US_IER_SPI_SLAVE_MASK       _U(0x000F3FE7) /**< \brief (US_IER_SPI_SLAVE) MASK Register */

