frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// USART mode
#define US_IER_USART_RXRDY_Pos      0            /**< \brief (US_IER_USART) Receiver Ready Interrupt Enable */
#define US_IER_USART_RXRDY          (_U(0x1) << US_IER_USART_RXRDY_Pos)
#define   US_IER_USART_RXRDY_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RXRDY_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RXRDY_0        (US_IER_USART_RXRDY_0_Val      << US_IER_USART_RXRDY_Pos)
#define US_IER_USART_RXRDY_1        (US_IER_USART_RXRDY_1_Val      << US_IER_USART_RXRDY_Pos)
#define US_IER_USART_TXRDY_Pos      1            /**< \brief (US_IER_USART) Transmitter Ready Interrupt Enable */
#define US_IER_USART_TXRDY          (_U(0x1) << US_IER_USART_TXRDY_Pos)
#define   US_IER_USART_TXRDY_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TXRDY_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TXRDY_0        (US_IER_USART_TXRDY_0_Val      << US_IER_USART_TXRDY_Pos)
#define US_IER_USART_TXRDY_1        (US_IER_USART_TXRDY_1_Val      << US_IER_USART_TXRDY_Pos)
#define US_IER_USART_RXBRK_Pos      2            /**< \brief (US_IER_USART) Receiver Break Interrupt Enable */
#define US_IER_USART_RXBRK          (_U(0x1) << US_IER_USART_RXBRK_Pos)
#define   US_IER_USART_RXBRK_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RXBRK_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RXBRK_0        (US_IER_USART_RXBRK_0_Val      << US_IER_USART_RXBRK_Pos)
#define US_IER_USART_RXBRK_1        (US_IER_USART_RXBRK_1_Val      << US_IER_USART_RXBRK_Pos)
#define US_IER_USART_OVRE_Pos       5            /**< \brief (US_IER_USART) Overrun Error Interrupt Enable */
#define US_IER_USART_OVRE           (_U(0x1) << US_IER_USART_OVRE_Pos)
#define   US_IER_USART_OVRE_0_Val         _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_OVRE_1_Val         _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_OVRE_0         (US_IER_USART_OVRE_0_Val       << US_IER_USART_OVRE_Pos)
#define US_IER_USART_OVRE_1         (US_IER_USART_OVRE_1_Val       << US_IER_USART_OVRE_Pos)
#define US_IER_USART_FRAME_Pos      6            /**< \brief (US_IER_USART) Framing Error Interrupt Enable */
#define US_IER_USART_FRAME          (_U(0x1) << US_IER_USART_FRAME_Pos)
#define   US_IER_USART_FRAME_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_FRAME_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_FRAME_0        (US_IER_USART_FRAME_0_Val      << US_IER_USART_FRAME_Pos)
#define US_IER_USART_FRAME_1        (US_IER_USART_FRAME_1_Val      << US_IER_USART_FRAME_Pos)
#define US_IER_USART_PARE_Pos       7            /**< \brief (US_IER_USART) Parity Error Interrupt Enable */
#define US_IER_USART_PARE           (_U(0x1) << US_IER_USART_PARE_Pos)
#define   US_IER_USART_PARE_0_Val         _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_PARE_1_Val         _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_PARE_0         (US_IER_USART_PARE_0_Val       << US_IER_USART_PARE_Pos)
#define US_IER_USART_PARE_1         (US_IER_USART_PARE_1_Val       << US_IER_USART_PARE_Pos)
#define US_IER_USART_TIMEOUT_Pos    8            /**< \brief (US_IER_USART) Time-out Interrupt Enable */
#define US_IER_USART_TIMEOUT        (_U(0x1) << US_IER_USART_TIMEOUT_Pos)
#define   US_IER_USART_TIMEOUT_0_Val      _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TIMEOUT_1_Val      _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TIMEOUT_0      (US_IER_USART_TIMEOUT_0_Val    << US_IER_USART_TIMEOUT_Pos)
#define US_IER_USART_TIMEOUT_1      (US_IER_USART_TIMEOUT_1_Val    << US_IER_USART_TIMEOUT_Pos)
#define US_IER_USART_TXEMPTY_Pos    9            /**< \brief (US_IER_USART) Transmitter Empty Interrupt Enable */
#define US_IER_USART_TXEMPTY        (_U(0x1) << US_IER_USART_TXEMPTY_Pos)
#define   US_IER_USART_TXEMPTY_0_Val      _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TXEMPTY_1_Val      _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TXEMPTY_0      (US_IER_USART_TXEMPTY_0_Val    << US_IER_USART_TXEMPTY_Pos)
#define US_IER_USART_TXEMPTY_1      (US_IER_USART_TXEMPTY_1_Val    << US_IER_USART_TXEMPTY_Pos)
#define US_IER_USART_ITER_Pos       10           /**< \brief (US_IER_USART) Iteration Interrupt Enable */
#define US_IER_USART_ITER           (_U(0x1) << US_IER_USART_ITER_Pos)
#define   US_IER_USART_ITER_0_Val         _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_ITER_1_Val         _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_ITER_0         (US_IER_USART_ITER_0_Val       << US_IER_USART_ITER_Pos)
#define US_IER_USART_ITER_1         (US_IER_USART_ITER_1_Val       << US_IER_USART_ITER_Pos)
#define US_IER_USART_TXBUFE_Pos     11           /**< \brief (US_IER_USART) Buffer Empty Interrupt Enable */
#define US_IER_USART_TXBUFE         (_U(0x1) << US_IER_USART_TXBUFE_Pos)
#define   US_IER_USART_TXBUFE_0_Val       _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_TXBUFE_1_Val       _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_TXBUFE_0       (US_IER_USART_TXBUFE_0_Val     << US_IER_USART_TXBUFE_Pos)
#define US_IER_USART_TXBUFE_1       (US_IER_USART_TXBUFE_1_Val     << US_IER_USART_TXBUFE_Pos)
#define US_IER_USART_RXBUFF_Pos     12           /**< \brief (US_IER_USART) Buffer Full Interrupt Enable */
#define US_IER_USART_RXBUFF         (_U(0x1) << US_IER_USART_RXBUFF_Pos)
#define   US_IER_USART_RXBUFF_0_Val       _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RXBUFF_1_Val       _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RXBUFF_0       (US_IER_USART_RXBUFF_0_Val     << US_IER_USART_RXBUFF_Pos)
#define US_IER_USART_RXBUFF_1       (US_IER_USART_RXBUFF_1_Val     << US_IER_USART_RXBUFF_Pos)
#define US_IER_USART_NACK_Pos       13           /**< \brief (US_IER_USART) Non Acknowledge Interrupt Enable */
#define US_IER_USART_NACK           (_U(0x1) << US_IER_USART_NACK_Pos)
#define   US_IER_USART_NACK_0_Val         _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_NACK_1_Val         _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_NACK_0         (US_IER_USART_NACK_0_Val       << US_IER_USART_NACK_Pos)
#define US_IER_USART_NACK_1         (US_IER_USART_NACK_1_Val       << US_IER_USART_NACK_Pos)
#define US_IER_USART_RIIC_Pos       16           /**< \brief (US_IER_USART) Ring Indicator Input Change Enable */
#define US_IER_USART_RIIC           (_U(0x1) << US_IER_USART_RIIC_Pos)
#define   US_IER_USART_RIIC_0_Val         _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_RIIC_1_Val         _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_RIIC_0         (US_IER_USART_RIIC_0_Val       << US_IER_USART_RIIC_Pos)
#define US_IER_USART_RIIC_1         (US_IER_USART_RIIC_1_Val       << US_IER_USART_RIIC_Pos)
#define US_IER_USART_DSRIC_Pos      17           /**< \brief (US_IER_USART) Data Set Ready Input Change Enable */
#define US_IER_USART_DSRIC          (_U(0x1) << US_IER_USART_DSRIC_Pos)
#define   US_IER_USART_DSRIC_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_DSRIC_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_DSRIC_0        (US_IER_USART_DSRIC_0_Val      << US_IER_USART_DSRIC_Pos)
#define US_IER_USART_DSRIC_1        (US_IER_USART_DSRIC_1_Val      << US_IER_USART_DSRIC_Pos)
#define US_IER_USART_DCDIC_Pos      18           /**< \brief (US_IER_USART) Data Carrier Detect Input Change Interrupt Enable */
#define US_IER_USART_DCDIC          (_U(0x1) << US_IER_USART_DCDIC_Pos)
#define   US_IER_USART_DCDIC_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_DCDIC_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_DCDIC_0        (US_IER_USART_DCDIC_0_Val      << US_IER_USART_DCDIC_Pos)
#define US_IER_USART_DCDIC_1        (US_IER_USART_DCDIC_1_Val      << US_IER_USART_DCDIC_Pos)
#define US_IER_USART_CTSIC_Pos      19           /**< \brief (US_IER_USART) Clear to Send Input Change Interrupt Enable */
#define US_IER_USART_CTSIC          (_U(0x1) << US_IER_USART_CTSIC_Pos)
#define   US_IER_USART_CTSIC_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No Effect */
#define   US_IER_USART_CTSIC_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_CTSIC_0        (US_IER_USART_CTSIC_0_Val      << US_IER_USART_CTSIC_Pos)
#define US_IER_USART_CTSIC_1        (US_IER_USART_CTSIC_1_Val      << US_IER_USART_CTSIC_Pos)
#define US_IER_USART_MANE_Pos       20           /**< \brief (US_IER_USART) Manchester Error Interrupt Enable */
#define US_IER_USART_MANE           (_U(0x1) << US_IER_USART_MANE_Pos)
#define US_IER_USART_MANEA_Pos      24           /**< \brief (US_IER_USART) Manchester Error Interrupt Enable */
#define US_IER_USART_MANEA          (_U(0x1) << US_IER_USART_MANEA_Pos)
#define   US_IER_USART_MANEA_0_Val        _U(0x0)   /**< \brief (US_IER_USART) No effect */
#define   US_IER_USART_MANEA_1_Val        _U(0x1)   /**< \brief (US_IER_USART) Enables the interrupt */
#define US_IER_USART_MANEA_0        (US_IER_USART_MANEA_0_Val      << US_IER_USART_MANEA_Pos)
#define US_IER_USART_MANEA_1        (US_IER_USART_MANEA_1_Val      << US_IER_USART_MANEA_Pos)
#define US_IER_USART_MASK           _U(0x011F3FE7) /**< \brief (US_IER_USART) MASK Register */

// Any mode
#define US_IER_RXRDY_Pos            0            /**< \brief (US_IER) Receiver Ready Interrupt Enable */
#define US_IER_RXRDY                (_U(0x1) << US_IER_RXRDY_Pos)
#define   US_IER_RXRDY_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_RXRDY_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_RXRDY_0              (US_IER_RXRDY_0_Val            << US_IER_RXRDY_Pos)
#define US_IER_RXRDY_1              (US_IER_RXRDY_1_Val            << US_IER_RXRDY_Pos)
#define US_IER_TXRDY_Pos            1            /**< \brief (US_IER) Transmitter Ready Interrupt Enable */
#define US_IER_TXRDY                (_U(0x1) << US_IER_TXRDY_Pos)
#define   US_IER_TXRDY_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_TXRDY_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TXRDY_0              (US_IER_TXRDY_0_Val            << US_IER_TXRDY_Pos)
#define US_IER_TXRDY_1              (US_IER_TXRDY_1_Val            << US_IER_TXRDY_Pos)
#define US_IER_RXBRK_Pos            2            /**< \brief (US_IER) Receiver Break Interrupt Enable */
#define US_IER_RXBRK                (_U(0x1) << US_IER_RXBRK_Pos)
#define   US_IER_RXBRK_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_RXBRK_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_RXBRK_0              (US_IER_RXBRK_0_Val            << US_IER_RXBRK_Pos)
#define US_IER_RXBRK_1              (US_IER_RXBRK_1_Val            << US_IER_RXBRK_Pos)
#define US_IER_OVRE_Pos             5            /**< \brief (US_IER) Overrun Error Interrupt Enable */
#define US_IER_OVRE                 (_U(0x1) << US_IER_OVRE_Pos)
#define   US_IER_OVRE_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_OVRE_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_OVRE_0               (US_IER_OVRE_0_Val             << US_IER_OVRE_Pos)
#define US_IER_OVRE_1               (US_IER_OVRE_1_Val             << US_IER_OVRE_Pos)
#define US_IER_FRAME_Pos            6            /**< \brief (US_IER) Framing Error Interrupt Enable */
#define US_IER_FRAME                (_U(0x1) << US_IER_FRAME_Pos)
#define   US_IER_FRAME_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_FRAME_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_FRAME_0              (US_IER_FRAME_0_Val            << US_IER_FRAME_Pos)
#define US_IER_FRAME_1              (US_IER_FRAME_1_Val            << US_IER_FRAME_Pos)
#define US_IER_PARE_Pos             7            /**< \brief (US_IER) Parity Error Interrupt Enable */
#define US_IER_PARE                 (_U(0x1) << US_IER_PARE_Pos)
#define   US_IER_PARE_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_PARE_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_PARE_0               (US_IER_PARE_0_Val             << US_IER_PARE_Pos)
#define US_IER_PARE_1               (US_IER_PARE_1_Val             << US_IER_PARE_Pos)
#define US_IER_TIMEOUT_Pos          8            /**< \brief (US_IER) Time-out Interrupt Enable */
#define US_IER_TIMEOUT              (_U(0x1) << US_IER_TIMEOUT_Pos)
#define   US_IER_TIMEOUT_0_Val            _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_TIMEOUT_1_Val            _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TIMEOUT_0            (US_IER_TIMEOUT_0_Val          << US_IER_TIMEOUT_Pos)
#define US_IER_TIMEOUT_1            (US_IER_TIMEOUT_1_Val          << US_IER_TIMEOUT_Pos)
#define US_IER_TXEMPTY_Pos          9            /**< \brief (US_IER) Transmitter Empty Interrupt Enable */
#define US_IER_TXEMPTY              (_U(0x1) << US_IER_TXEMPTY_Pos)
#define   US_IER_TXEMPTY_0_Val            _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_TXEMPTY_1_Val            _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TXEMPTY_0            (US_IER_TXEMPTY_0_Val          << US_IER_TXEMPTY_Pos)
#define US_IER_TXEMPTY_1            (US_IER_TXEMPTY_1_Val          << US_IER_TXEMPTY_Pos)
#define US_IER_ITER_Pos             10           /**< \brief (US_IER) Iteration Interrupt Enable */
#define US_IER_ITER                 (_U(0x1) << US_IER_ITER_Pos)
#define   US_IER_ITER_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_ITER_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_ITER_0               (US_IER_ITER_0_Val             << US_IER_ITER_Pos)
#define US_IER_ITER_1               (US_IER_ITER_1_Val             << US_IER_ITER_Pos)
#define US_IER_UNRE_Pos             10           /**< \brief (US_IER) SPI Underrun Error Interrupt Enable */
#define US_IER_UNRE                 (_U(0x1) << US_IER_UNRE_Pos)
#define   US_IER_UNRE_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_UNRE_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_UNRE_0               (US_IER_UNRE_0_Val             << US_IER_UNRE_Pos)
#define US_IER_UNRE_1               (US_IER_UNRE_1_Val             << US_IER_UNRE_Pos)
#define US_IER_ITER_Pos             10           /**< \brief (US_IER) Iteration Interrupt Enable */
#define US_IER_ITER                 (_U(0x1) << US_IER_ITER_Pos)
#define   US_IER_ITER_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_ITER_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_ITER_0               (US_IER_ITER_0_Val             << US_IER_ITER_Pos)
#define US_IER_ITER_1               (US_IER_ITER_1_Val             << US_IER_ITER_Pos)
#define US_IER_TXBUFE_Pos           11           /**< \brief (US_IER) Buffer Empty Interrupt Enable */
#define US_IER_TXBUFE               (_U(0x1) << US_IER_TXBUFE_Pos)
#define   US_IER_TXBUFE_0_Val             _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_TXBUFE_1_Val             _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_TXBUFE_0             (US_IER_TXBUFE_0_Val           << US_IER_TXBUFE_Pos)
#define US_IER_TXBUFE_1             (US_IER_TXBUFE_1_Val           << US_IER_TXBUFE_Pos)
#define US_IER_RXBUFF_Pos           12           /**< \brief (US_IER) Buffer Full Interrupt Enable */
#define US_IER_RXBUFF               (_U(0x1) << US_IER_RXBUFF_Pos)
#define   US_IER_RXBUFF_0_Val             _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_RXBUFF_1_Val             _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_RXBUFF_0             (US_IER_RXBUFF_0_Val           << US_IER_RXBUFF_Pos)
#define US_IER_RXBUFF_1             (US_IER_RXBUFF_1_Val           << US_IER_RXBUFF_Pos)
#define US_IER_NACK_Pos             13           /**< \brief (US_IER) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Enable */
#define US_IER_NACK                 (_U(0x1) << US_IER_NACK_Pos)
#define   US_IER_NACK_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_NACK_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_NACK_0               (US_IER_NACK_0_Val             << US_IER_NACK_Pos)
#define US_IER_NACK_1               (US_IER_NACK_1_Val             << US_IER_NACK_Pos)
#define US_IER_LINID_Pos            14           /**< \brief (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
#define US_IER_LINID                (_U(0x1) << US_IER_LINID_Pos)
#define US_IER_LINTC_Pos            15           /**< \brief (US_IER) LIN Transfer Conpleted Interrupt Enable */
#define US_IER_LINTC                (_U(0x1) << US_IER_LINTC_Pos)
#define US_IER_RIIC_Pos             16           /**< \brief (US_IER) Ring Indicator Input Change Enable */
#define US_IER_RIIC                 (_U(0x1) << US_IER_RIIC_Pos)
#define   US_IER_RIIC_0_Val               _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_RIIC_1_Val               _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_RIIC_0               (US_IER_RIIC_0_Val             << US_IER_RIIC_Pos)
#define US_IER_RIIC_1               (US_IER_RIIC_1_Val             << US_IER_RIIC_Pos)
#define US_IER_DSRIC_Pos            17           /**< \brief (US_IER) Data Set Ready Input Change Enable */
#define US_IER_DSRIC                (_U(0x1) << US_IER_DSRIC_Pos)
#define   US_IER_DSRIC_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_DSRIC_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_DSRIC_0              (US_IER_DSRIC_0_Val            << US_IER_DSRIC_Pos)
#define US_IER_DSRIC_1              (US_IER_DSRIC_1_Val            << US_IER_DSRIC_Pos)
#define US_IER_DCDIC_Pos            18           /**< \brief (US_IER) Data Carrier Detect Input Change Interrupt Enable */
#define US_IER_DCDIC                (_U(0x1) << US_IER_DCDIC_Pos)
#define   US_IER_DCDIC_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_DCDIC_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_DCDIC_0              (US_IER_DCDIC_0_Val            << US_IER_DCDIC_Pos)
#define US_IER_DCDIC_1              (US_IER_DCDIC_1_Val            << US_IER_DCDIC_Pos)
#define US_IER_CTSIC_Pos            19           /**< \brief (US_IER) Clear to Send Input Change Interrupt Enable */
#define US_IER_CTSIC                (_U(0x1) << US_IER_CTSIC_Pos)
#define   US_IER_CTSIC_0_Val              _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_CTSIC_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_CTSIC_0              (US_IER_CTSIC_0_Val            << US_IER_CTSIC_Pos)
#define US_IER_CTSIC_1              (US_IER_CTSIC_1_Val            << US_IER_CTSIC_Pos)
#define US_IER_MANE_Pos             20           /**< \brief (US_IER) Manchester Error Interrupt Enable */
#define US_IER_MANE                 (_U(0x1) << US_IER_MANE_Pos)
#define US_IER_MANEA_Pos            24           /**< \brief (US_IER) Manchester Error Interrupt Enable */
#define US_IER_MANEA                (_U(0x1) << US_IER_MANEA_Pos)
#define   US_IER_MANEA_0_Val              _U(0x0)   /**< \brief (US_IER) No effect */
#define   US_IER_MANEA_1_Val              _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_MANEA_0              (US_IER_MANEA_0_Val            << US_IER_MANEA_Pos)
#define US_IER_MANEA_1              (US_IER_MANEA_1_Val            << US_IER_MANEA_Pos)
#define US_IER_LINBE_Pos            25           /**< \brief (US_IER) LIN Bus Error Interrupt Enable */
#define US_IER_LINBE                (_U(0x1) << US_IER_LINBE_Pos)
#define US_IER_LINISFE_Pos          26           /**< \brief (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable */
#define US_IER_LINISFE              (_U(0x1) << US_IER_LINISFE_Pos)
#define US_IER_LINIPE_Pos           27           /**< \brief (US_IER) LIN Identifier Parity Interrupt Enable */
#define US_IER_LINIPE               (_U(0x1) << US_IER_LINIPE_Pos)
#define US_IER_LINCE_Pos            28           /**< \brief (US_IER) LIN Checksum Error Interrupt Enable */
#define US_IER_LINCE                (_U(0x1) << US_IER_LINCE_Pos)
#define US_IER_LINSNRE_Pos          29           /**< \brief (US_IER) LIN Slave Not Responding Error Interrupt Enable */
#define US_IER_LINSNRE              (_U(0x1) << US_IER_LINSNRE_Pos)
#define US_IER_LINSTE_Pos           30           /**< \brief (US_IER) LIN Synch Tolerance Error Interrupt Enable */
#define US_IER_LINSTE               (_U(0x1) << US_IER_LINSTE_Pos)
#define   US_IER_LINSTE_0_Val             _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_LINSTE_1_Val             _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_LINSTE_0             (US_IER_LINSTE_0_Val           << US_IER_LINSTE_Pos)
#define US_IER_LINSTE_1             (US_IER_LINSTE_1_Val           << US_IER_LINSTE_Pos)
#define US_IER_LINHTE_Pos           31           /**< \brief (US_IER) LIN Header Timeout Error Interrupt Enable */
#define US_IER_LINHTE               (_U(0x1) << US_IER_LINHTE_Pos)
#define   US_IER_LINHTE_0_Val             _U(0x0)   /**< \brief (US_IER) No Effect */
#define   US_IER_LINHTE_1_Val             _U(0x1)   /**< \brief (US_IER) Enables the interrupt */
#define US_IER_LINHTE_0             (US_IER_LINHTE_0_Val           << US_IER_LINHTE_Pos)
#define US_IER_LINHTE_1             (US_IER_LINHTE_1_Val           << US_IER_LINHTE_Pos)
#define US_IER_MASK                 _U(0xFF1FFFE7) /**< \brief (US_IER) MASK Register */

