frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// USART mode
#define US_IDR_USART_RXRDY_Pos      0            /**< \brief (US_IDR_USART) Receiver Ready Interrupt Disable */
#define US_IDR_USART_RXRDY          (_U(0x1) << US_IDR_USART_RXRDY_Pos)
#define   US_IDR_USART_RXRDY_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RXRDY_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RXRDY_0        (US_IDR_USART_RXRDY_0_Val      << US_IDR_USART_RXRDY_Pos)
#define US_IDR_USART_RXRDY_1        (US_IDR_USART_RXRDY_1_Val      << US_IDR_USART_RXRDY_Pos)
#define US_IDR_USART_TXRDY_Pos      1            /**< \brief (US_IDR_USART) Transmitter Ready Interrupt Disable */
#define US_IDR_USART_TXRDY          (_U(0x1) << US_IDR_USART_TXRDY_Pos)
#define   US_IDR_USART_TXRDY_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TXRDY_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TXRDY_0        (US_IDR_USART_TXRDY_0_Val      << US_IDR_USART_TXRDY_Pos)
#define US_IDR_USART_TXRDY_1        (US_IDR_USART_TXRDY_1_Val      << US_IDR_USART_TXRDY_Pos)
#define US_IDR_USART_RXBRK_Pos      2            /**< \brief (US_IDR_USART) Receiver Break Interrupt Disable */
#define US_IDR_USART_RXBRK          (_U(0x1) << US_IDR_USART_RXBRK_Pos)
#define   US_IDR_USART_RXBRK_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RXBRK_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RXBRK_0        (US_IDR_USART_RXBRK_0_Val      << US_IDR_USART_RXBRK_Pos)
#define US_IDR_USART_RXBRK_1        (US_IDR_USART_RXBRK_1_Val      << US_IDR_USART_RXBRK_Pos)
#define US_IDR_USART_OVRE_Pos       5            /**< \brief (US_IDR_USART) Overrun Error Interrupt Disable */
#define US_IDR_USART_OVRE           (_U(0x1) << US_IDR_USART_OVRE_Pos)
#define   US_IDR_USART_OVRE_0_Val         _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_OVRE_1_Val         _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_OVRE_0         (US_IDR_USART_OVRE_0_Val       << US_IDR_USART_OVRE_Pos)
#define US_IDR_USART_OVRE_1         (US_IDR_USART_OVRE_1_Val       << US_IDR_USART_OVRE_Pos)
#define US_IDR_USART_FRAME_Pos      6            /**< \brief (US_IDR_USART) Framing Error Interrupt Disable */
#define US_IDR_USART_FRAME          (_U(0x1) << US_IDR_USART_FRAME_Pos)
#define   US_IDR_USART_FRAME_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_FRAME_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_FRAME_0        (US_IDR_USART_FRAME_0_Val      << US_IDR_USART_FRAME_Pos)
#define US_IDR_USART_FRAME_1        (US_IDR_USART_FRAME_1_Val      << US_IDR_USART_FRAME_Pos)
#define US_IDR_USART_PARE_Pos       7            /**< \brief (US_IDR_USART) Parity Error Interrupt Disable */
#define US_IDR_USART_PARE           (_U(0x1) << US_IDR_USART_PARE_Pos)
#define   US_IDR_USART_PARE_0_Val         _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_PARE_1_Val         _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_PARE_0         (US_IDR_USART_PARE_0_Val       << US_IDR_USART_PARE_Pos)
#define US_IDR_USART_PARE_1         (US_IDR_USART_PARE_1_Val       << US_IDR_USART_PARE_Pos)
#define US_IDR_USART_TIMEOUT_Pos    8            /**< \brief (US_IDR_USART) Time-out Interrupt Disable */
#define US_IDR_USART_TIMEOUT        (_U(0x1) << US_IDR_USART_TIMEOUT_Pos)
#define   US_IDR_USART_TIMEOUT_0_Val      _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TIMEOUT_1_Val      _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TIMEOUT_0      (US_IDR_USART_TIMEOUT_0_Val    << US_IDR_USART_TIMEOUT_Pos)
#define US_IDR_USART_TIMEOUT_1      (US_IDR_USART_TIMEOUT_1_Val    << US_IDR_USART_TIMEOUT_Pos)
#define US_IDR_USART_TXEMPTY_Pos    9            /**< \brief (US_IDR_USART) Transmitter Empty Interrupt Disable */
#define US_IDR_USART_TXEMPTY        (_U(0x1) << US_IDR_USART_TXEMPTY_Pos)
#define   US_IDR_USART_TXEMPTY_0_Val      _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TXEMPTY_1_Val      _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TXEMPTY_0      (US_IDR_USART_TXEMPTY_0_Val    << US_IDR_USART_TXEMPTY_Pos)
#define US_IDR_USART_TXEMPTY_1      (US_IDR_USART_TXEMPTY_1_Val    << US_IDR_USART_TXEMPTY_Pos)
#define US_IDR_USART_ITER_Pos       10           /**< \brief (US_IDR_USART) Iteration Interrupt Disable */
#define US_IDR_USART_ITER           (_U(0x1) << US_IDR_USART_ITER_Pos)
#define   US_IDR_USART_ITER_0_Val         _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_ITER_1_Val         _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_ITER_0         (US_IDR_USART_ITER_0_Val       << US_IDR_USART_ITER_Pos)
#define US_IDR_USART_ITER_1         (US_IDR_USART_ITER_1_Val       << US_IDR_USART_ITER_Pos)
#define US_IDR_USART_TXBUFE_Pos     11           /**< \brief (US_IDR_USART) Buffer Empty Interrupt Disable */
#define US_IDR_USART_TXBUFE         (_U(0x1) << US_IDR_USART_TXBUFE_Pos)
#define   US_IDR_USART_TXBUFE_0_Val       _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_TXBUFE_1_Val       _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_TXBUFE_0       (US_IDR_USART_TXBUFE_0_Val     << US_IDR_USART_TXBUFE_Pos)
#define US_IDR_USART_TXBUFE_1       (US_IDR_USART_TXBUFE_1_Val     << US_IDR_USART_TXBUFE_Pos)
#define US_IDR_USART_RXBUFF_Pos     12           /**< \brief (US_IDR_USART) Buffer Full Interrupt Disable */
#define US_IDR_USART_RXBUFF         (_U(0x1) << US_IDR_USART_RXBUFF_Pos)
#define   US_IDR_USART_RXBUFF_0_Val       _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RXBUFF_1_Val       _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RXBUFF_0       (US_IDR_USART_RXBUFF_0_Val     << US_IDR_USART_RXBUFF_Pos)
#define US_IDR_USART_RXBUFF_1       (US_IDR_USART_RXBUFF_1_Val     << US_IDR_USART_RXBUFF_Pos)
#define US_IDR_USART_NACK_Pos       13           /**< \brief (US_IDR_USART) Non Acknowledge Interrupt Disable */
#define US_IDR_USART_NACK           (_U(0x1) << US_IDR_USART_NACK_Pos)
#define   US_IDR_USART_NACK_0_Val         _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_NACK_1_Val         _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_NACK_0         (US_IDR_USART_NACK_0_Val       << US_IDR_USART_NACK_Pos)
#define US_IDR_USART_NACK_1         (US_IDR_USART_NACK_1_Val       << US_IDR_USART_NACK_Pos)
#define US_IDR_USART_RIIC_Pos       16           /**< \brief (US_IDR_USART) Ring Indicator Input Change Disable */
#define US_IDR_USART_RIIC           (_U(0x1) << US_IDR_USART_RIIC_Pos)
#define   US_IDR_USART_RIIC_0_Val         _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_RIIC_1_Val         _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_RIIC_0         (US_IDR_USART_RIIC_0_Val       << US_IDR_USART_RIIC_Pos)
#define US_IDR_USART_RIIC_1         (US_IDR_USART_RIIC_1_Val       << US_IDR_USART_RIIC_Pos)
#define US_IDR_USART_DSRIC_Pos      17           /**< \brief (US_IDR_USART) Data Set Ready Input Change Disable */
#define US_IDR_USART_DSRIC          (_U(0x1) << US_IDR_USART_DSRIC_Pos)
#define   US_IDR_USART_DSRIC_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_DSRIC_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_DSRIC_0        (US_IDR_USART_DSRIC_0_Val      << US_IDR_USART_DSRIC_Pos)
#define US_IDR_USART_DSRIC_1        (US_IDR_USART_DSRIC_1_Val      << US_IDR_USART_DSRIC_Pos)
#define US_IDR_USART_DCDIC_Pos      18           /**< \brief (US_IDR_USART) Data Carrier Detect Input Change Interrupt Disable */
#define US_IDR_USART_DCDIC          (_U(0x1) << US_IDR_USART_DCDIC_Pos)
#define   US_IDR_USART_DCDIC_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_DCDIC_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_DCDIC_0        (US_IDR_USART_DCDIC_0_Val      << US_IDR_USART_DCDIC_Pos)
#define US_IDR_USART_DCDIC_1        (US_IDR_USART_DCDIC_1_Val      << US_IDR_USART_DCDIC_Pos)
#define US_IDR_USART_CTSIC_Pos      19           /**< \brief (US_IDR_USART) Clear to Send Input Change Interrupt Disable */
#define US_IDR_USART_CTSIC          (_U(0x1) << US_IDR_USART_CTSIC_Pos)
#define   US_IDR_USART_CTSIC_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No Effect */
#define   US_IDR_USART_CTSIC_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the interrupt */
#define US_IDR_USART_CTSIC_0        (US_IDR_USART_CTSIC_0_Val      << US_IDR_USART_CTSIC_Pos)
#define US_IDR_USART_CTSIC_1        (US_IDR_USART_CTSIC_1_Val      << US_IDR_USART_CTSIC_Pos)
#define US_IDR_USART_MANE_Pos       20           /**< \brief (US_IDR_USART) Manchester Error Interrupt Disable */
#define US_IDR_USART_MANE           (_U(0x1) << US_IDR_USART_MANE_Pos)
#define US_IDR_USART_MANEA_Pos      24           /**< \brief (US_IDR_USART) Manchester Error Interrupt Disable */
#define US_IDR_USART_MANEA          (_U(0x1) << US_IDR_USART_MANEA_Pos)
#define   US_IDR_USART_MANEA_0_Val        _U(0x0)   /**< \brief (US_IDR_USART) No effect */
#define   US_IDR_USART_MANEA_1_Val        _U(0x1)   /**< \brief (US_IDR_USART) Disables the corresponding interrupt */
#define US_IDR_USART_MANEA_0        (US_IDR_USART_MANEA_0_Val      << US_IDR_USART_MANEA_Pos)
#define US_IDR_USART_MANEA_1        (US_IDR_USART_MANEA_1_Val      << US_IDR_USART_MANEA_Pos)
#define US_IDR_USART_MASK           _U(0x011F3FE7) /**< \brief (US_IDR_USART) MASK Register */

// Any mode
#define US_IDR_RXRDY_Pos            0            /**< \brief (US_IDR) Receiver Ready Interrupt Disable */
#define US_IDR_RXRDY                (_U(0x1) << US_IDR_RXRDY_Pos)
#define   US_IDR_RXRDY_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_RXRDY_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_RXRDY_0              (US_IDR_RXRDY_0_Val            << US_IDR_RXRDY_Pos)
#define US_IDR_RXRDY_1              (US_IDR_RXRDY_1_Val            << US_IDR_RXRDY_Pos)
#define US_IDR_TXRDY_Pos            1            /**< \brief (US_IDR) Transmitter Ready Interrupt Disable */
#define US_IDR_TXRDY                (_U(0x1) << US_IDR_TXRDY_Pos)
#define   US_IDR_TXRDY_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_TXRDY_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TXRDY_0              (US_IDR_TXRDY_0_Val            << US_IDR_TXRDY_Pos)
#define US_IDR_TXRDY_1              (US_IDR_TXRDY_1_Val            << US_IDR_TXRDY_Pos)
#define US_IDR_RXBRK_Pos            2            /**< \brief (US_IDR) Receiver Break Interrupt Disable */
#define US_IDR_RXBRK                (_U(0x1) << US_IDR_RXBRK_Pos)
#define   US_IDR_RXBRK_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_RXBRK_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_RXBRK_0              (US_IDR_RXBRK_0_Val            << US_IDR_RXBRK_Pos)
#define US_IDR_RXBRK_1              (US_IDR_RXBRK_1_Val            << US_IDR_RXBRK_Pos)
#define US_IDR_OVRE_Pos             5            /**< \brief (US_IDR) Overrun Error Interrupt Disable */
#define US_IDR_OVRE                 (_U(0x1) << US_IDR_OVRE_Pos)
#define   US_IDR_OVRE_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_OVRE_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_OVRE_0               (US_IDR_OVRE_0_Val             << US_IDR_OVRE_Pos)
#define US_IDR_OVRE_1               (US_IDR_OVRE_1_Val             << US_IDR_OVRE_Pos)
#define US_IDR_FRAME_Pos            6            /**< \brief (US_IDR) Framing Error Interrupt Disable */
#define US_IDR_FRAME                (_U(0x1) << US_IDR_FRAME_Pos)
#define   US_IDR_FRAME_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_FRAME_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_FRAME_0              (US_IDR_FRAME_0_Val            << US_IDR_FRAME_Pos)
#define US_IDR_FRAME_1              (US_IDR_FRAME_1_Val            << US_IDR_FRAME_Pos)
#define US_IDR_PARE_Pos             7            /**< \brief (US_IDR) Parity Error Interrupt Disable */
#define US_IDR_PARE                 (_U(0x1) << US_IDR_PARE_Pos)
#define   US_IDR_PARE_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_PARE_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_PARE_0               (US_IDR_PARE_0_Val             << US_IDR_PARE_Pos)
#define US_IDR_PARE_1               (US_IDR_PARE_1_Val             << US_IDR_PARE_Pos)
#define US_IDR_TIMEOUT_Pos          8            /**< \brief (US_IDR) Time-out Interrupt Disable */
#define US_IDR_TIMEOUT              (_U(0x1) << US_IDR_TIMEOUT_Pos)
#define   US_IDR_TIMEOUT_0_Val            _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_TIMEOUT_1_Val            _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TIMEOUT_0            (US_IDR_TIMEOUT_0_Val          << US_IDR_TIMEOUT_Pos)
#define US_IDR_TIMEOUT_1            (US_IDR_TIMEOUT_1_Val          << US_IDR_TIMEOUT_Pos)
#define US_IDR_TXEMPTY_Pos          9            /**< \brief (US_IDR) Transmitter Empty Interrupt Disable */
#define US_IDR_TXEMPTY              (_U(0x1) << US_IDR_TXEMPTY_Pos)
#define   US_IDR_TXEMPTY_0_Val            _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_TXEMPTY_1_Val            _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TXEMPTY_0            (US_IDR_TXEMPTY_0_Val          << US_IDR_TXEMPTY_Pos)
#define US_IDR_TXEMPTY_1            (US_IDR_TXEMPTY_1_Val          << US_IDR_TXEMPTY_Pos)
#define US_IDR_ITER_Pos             10           /**< \brief (US_IDR) Iteration Interrupt Disable */
#define US_IDR_ITER                 (_U(0x1) << US_IDR_ITER_Pos)
#define   US_IDR_ITER_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_ITER_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_ITER_0               (US_IDR_ITER_0_Val             << US_IDR_ITER_Pos)
#define US_IDR_ITER_1               (US_IDR_ITER_1_Val             << US_IDR_ITER_Pos)
#define US_IDR_UNRE_Pos             10           /**< \brief (US_IDR) SPI Underrun Error Interrupt Disable */
#define US_IDR_UNRE                 (_U(0x1) << US_IDR_UNRE_Pos)
#define   US_IDR_UNRE_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_UNRE_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_UNRE_0               (US_IDR_UNRE_0_Val             << US_IDR_UNRE_Pos)
#define US_IDR_UNRE_1               (US_IDR_UNRE_1_Val             << US_IDR_UNRE_Pos)
#define US_IDR_ITER_Pos             10           /**< \brief (US_IDR) Iteration Interrupt Disable */
#define US_IDR_ITER                 (_U(0x1) << US_IDR_ITER_Pos)
#define   US_IDR_ITER_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_ITER_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_ITER_0               (US_IDR_ITER_0_Val             << US_IDR_ITER_Pos)
#define US_IDR_ITER_1               (US_IDR_ITER_1_Val             << US_IDR_ITER_Pos)
#define US_IDR_TXBUFE_Pos           11           /**< \brief (US_IDR) Buffer Empty Interrupt Disable */
#define US_IDR_TXBUFE               (_U(0x1) << US_IDR_TXBUFE_Pos)
#define   US_IDR_TXBUFE_0_Val             _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_TXBUFE_1_Val             _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_TXBUFE_0             (US_IDR_TXBUFE_0_Val           << US_IDR_TXBUFE_Pos)
#define US_IDR_TXBUFE_1             (US_IDR_TXBUFE_1_Val           << US_IDR_TXBUFE_Pos)
#define US_IDR_RXBUFF_Pos           12           /**< \brief (US_IDR) Buffer Full Interrupt Disable */
#define US_IDR_RXBUFF               (_U(0x1) << US_IDR_RXBUFF_Pos)
#define   US_IDR_RXBUFF_0_Val             _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_RXBUFF_1_Val             _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_RXBUFF_0             (US_IDR_RXBUFF_0_Val           << US_IDR_RXBUFF_Pos)
#define US_IDR_RXBUFF_1             (US_IDR_RXBUFF_1_Val           << US_IDR_RXBUFF_Pos)
#define US_IDR_NACK_Pos             13           /**< \brief (US_IDR) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Disable */
#define US_IDR_NACK                 (_U(0x1) << US_IDR_NACK_Pos)
#define   US_IDR_NACK_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_NACK_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_NACK_0               (US_IDR_NACK_0_Val             << US_IDR_NACK_Pos)
#define US_IDR_NACK_1               (US_IDR_NACK_1_Val             << US_IDR_NACK_Pos)
#define US_IDR_LINID_Pos            14           /**< \brief (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable */
#define US_IDR_LINID                (_U(0x1) << US_IDR_LINID_Pos)
#define US_IDR_LINTC_Pos            15           /**< \brief (US_IDR) LIN Transfer Conpleted Interrupt Disable */
#define US_IDR_LINTC                (_U(0x1) << US_IDR_LINTC_Pos)
#define US_IDR_RIIC_Pos             16           /**< \brief (US_IDR) Ring Indicator Input Change Disable */
#define US_IDR_RIIC                 (_U(0x1) << US_IDR_RIIC_Pos)
#define   US_IDR_RIIC_0_Val               _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_RIIC_1_Val               _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_RIIC_0               (US_IDR_RIIC_0_Val             << US_IDR_RIIC_Pos)
#define US_IDR_RIIC_1               (US_IDR_RIIC_1_Val             << US_IDR_RIIC_Pos)
#define US_IDR_DSRIC_Pos            17           /**< \brief (US_IDR) Data Set Ready Input Change Disable */
#define US_IDR_DSRIC                (_U(0x1) << US_IDR_DSRIC_Pos)
#define   US_IDR_DSRIC_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_DSRIC_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_DSRIC_0              (US_IDR_DSRIC_0_Val            << US_IDR_DSRIC_Pos)
#define US_IDR_DSRIC_1              (US_IDR_DSRIC_1_Val            << US_IDR_DSRIC_Pos)
#define US_IDR_DCDIC_Pos            18           /**< \brief (US_IDR) Data Carrier Detect Input Change Interrupt Disable */
#define US_IDR_DCDIC                (_U(0x1) << US_IDR_DCDIC_Pos)
#define   US_IDR_DCDIC_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_DCDIC_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_DCDIC_0              (US_IDR_DCDIC_0_Val            << US_IDR_DCDIC_Pos)
#define US_IDR_DCDIC_1              (US_IDR_DCDIC_1_Val            << US_IDR_DCDIC_Pos)
#define US_IDR_CTSIC_Pos            19           /**< \brief (US_IDR) Clear to Send Input Change Interrupt Disable */
#define US_IDR_CTSIC                (_U(0x1) << US_IDR_CTSIC_Pos)
#define   US_IDR_CTSIC_0_Val              _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_CTSIC_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_CTSIC_0              (US_IDR_CTSIC_0_Val            << US_IDR_CTSIC_Pos)
#define US_IDR_CTSIC_1              (US_IDR_CTSIC_1_Val            << US_IDR_CTSIC_Pos)
#define US_IDR_MANE_Pos             20           /**< \brief (US_IDR) Manchester Error Interrupt Disable */
#define US_IDR_MANE                 (_U(0x1) << US_IDR_MANE_Pos)
#define US_IDR_MANEA_Pos            24           /**< \brief (US_IDR) Manchester Error Interrupt Disable */
#define US_IDR_MANEA                (_U(0x1) << US_IDR_MANEA_Pos)
#define   US_IDR_MANEA_0_Val              _U(0x0)   /**< \brief (US_IDR) No effect */
#define   US_IDR_MANEA_1_Val              _U(0x1)   /**< \brief (US_IDR) Disables the corresponding interrupt */
#define US_IDR_MANEA_0              (US_IDR_MANEA_0_Val            << US_IDR_MANEA_Pos)
#define US_IDR_MANEA_1              (US_IDR_MANEA_1_Val            << US_IDR_MANEA_Pos)
#define US_IDR_LINBE_Pos            25           /**< \brief (US_IDR) LIN Bus Error Interrupt Disable */
#define US_IDR_LINBE                (_U(0x1) << US_IDR_LINBE_Pos)
#define US_IDR_LINISFE_Pos          26           /**< \brief (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable */
#define US_IDR_LINISFE              (_U(0x1) << US_IDR_LINISFE_Pos)
#define US_IDR_LINIPE_Pos           27           /**< \brief (US_IDR) LIN Identifier Parity Interrupt Disable */
#define US_IDR_LINIPE               (_U(0x1) << US_IDR_LINIPE_Pos)
#define US_IDR_LINCE_Pos            28           /**< \brief (US_IDR) LIN Checksum Error Interrupt Disable */
#define US_IDR_LINCE                (_U(0x1) << US_IDR_LINCE_Pos)
#define US_IDR_LINSNRE_Pos          29           /**< \brief (US_IDR) LIN Slave Not Responding Error Interrupt Disable */
#define US_IDR_LINSNRE              (_U(0x1) << US_IDR_LINSNRE_Pos)
#define US_IDR_LINSTE_Pos           30           /**< \brief (US_IDR) LIN Synch Tolerance Error Interrupt Disable */
#define US_IDR_LINSTE               (_U(0x1) << US_IDR_LINSTE_Pos)
#define   US_IDR_LINSTE_0_Val             _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_LINSTE_1_Val             _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_LINSTE_0             (US_IDR_LINSTE_0_Val           << US_IDR_LINSTE_Pos)
#define US_IDR_LINSTE_1             (US_IDR_LINSTE_1_Val           << US_IDR_LINSTE_Pos)
#define US_IDR_LINHTE_Pos           31           /**< \brief (US_IDR) LIN Header Timeout Error Interrupt Disable */
#define US_IDR_LINHTE               (_U(0x1) << US_IDR_LINHTE_Pos)
#define   US_IDR_LINHTE_0_Val             _U(0x0)   /**< \brief (US_IDR) No Effect */
#define   US_IDR_LINHTE_1_Val             _U(0x1)   /**< \brief (US_IDR) Disables the interrupt */
#define US_IDR_LINHTE_0             (US_IDR_LINHTE_0_Val           << US_IDR_LINHTE_Pos)
#define US_IDR_LINHTE_1             (US_IDR_LINHTE_1_Val           << US_IDR_LINHTE_Pos)
#define US_IDR_MASK                 _U(0xFF1FFFE7) /**< \brief (US_IDR) MASK Register */

