frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
/* -------- US_IMR : (USART Offset: 0x10) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct { // LIN mode
    uint32_t RXRDY:1;          /*!< bit:      0  RXRDY Interrupt Mask               */
    uint32_t TXRDY:1;          /*!< bit:      1  TXRDY Interrupt Mask               */
    uint32_t RXBRK:1;          /*!< bit:      2  Receiver Break Interrupt Mask      */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t OVRE:1;           /*!< bit:      5  Overrun Error Interrupt Mask       */
    uint32_t FRAME:1;          /*!< bit:      6  Framing Error Interrupt Mask       */
    uint32_t PARE:1;           /*!< bit:      7  Parity Error Interrupt Mask        */
    uint32_t TIMEOUT:1;        /*!< bit:      8  Time-out Interrupt Mask            */
    uint32_t TXEMPTY:1;        /*!< bit:      9  TXEMPTY Interrupt Mask             */
    uint32_t ITER:1;           /*!< bit:     10  Iteration Interrupt Mask           */
    uint32_t TXBUFE:1;         /*!< bit:     11  Buffer Empty Interrupt Mask        */
    uint32_t RXBUFF:1;         /*!< bit:     12  Buffer Full Interrupt Mask         */
    uint32_t NACK:1;           /*!< bit:     13  Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Mask */
    uint32_t LINID:1;          /*!< bit:     14  LIN Identifier Sent or LIN Received Interrupt Mask */
    uint32_t LINTC:1;          /*!< bit:     15  LIN Transfer Conpleted Interrupt Mask */
    uint32_t RIIC:1;           /*!< bit:     16  Ring Indicator Input Change Mask   */
    uint32_t DSRIC:1;          /*!< bit:     17  Data Set Ready Input Change Mask   */
    uint32_t DCDIC:1;          /*!< bit:     18  Data Carrier Detect Input Change Interrupt Mask */
    uint32_t CTSIC:1;          /*!< bit:     19  Clear to Send Input Change Interrupt Mask */
    uint32_t :5;               /*!< bit: 20..24  Reserved                           */
    uint32_t LINBE:1;          /*!< bit:     25  LIN Bus Error Interrupt Mask       */
    uint32_t LINISFE:1;        /*!< bit:     26  LIN Inconsistent Synch Field Error Interrupt Mask */
    uint32_t LINIPE:1;         /*!< bit:     27  LIN Identifier Parity Interrupt Mask */
    uint32_t LINCE:1;          /*!< bit:     28  LIN Checksum Error Interrupt Mask  */
    uint32_t LINSNRE:1;        /*!< bit:     29  LIN Slave Not Responding Error Interrupt Mask */
    uint32_t LINSTE:1;         /*!< bit:     30  LIN Synch Tolerance Error Interrupt Mask */
    uint32_t LINHTE:1;         /*!< bit:     31  LIN Header Timeout Error Interrupt Mask */
  } LIN;                       /*!< Structure used for LIN                          */
  struct { // SPI_SLAVE mode
    uint32_t RXRDY:1;          /*!< bit:      0  RXRDY Interrupt Mask               */
    uint32_t TXRDY:1;          /*!< bit:      1  TXRDY Interrupt Mask               */
    uint32_t RXBRK:1;          /*!< bit:      2  Receiver Break Interrupt Mask      */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t OVRE:1;           /*!< bit:      5  Overrun Error Interrupt Mask       */
    uint32_t FRAME:1;          /*!< bit:      6  Framing Error Interrupt Mask       */
    uint32_t PARE:1;           /*!< bit:      7  Parity Error Interrupt Mask        */
    uint32_t TIMEOUT:1;        /*!< bit:      8  Time-out Interrupt Mask            */
    uint32_t TXEMPTY:1;        /*!< bit:      9  TXEMPTY Interrupt Mask             */
    uint32_t UNRE:1;           /*!< bit:     10  SPI Underrun Error Interrupt Mask  */
    uint32_t TXBUFE:1;         /*!< bit:     11  Buffer Empty Interrupt Mask        */
    uint32_t RXBUFF:1;         /*!< bit:     12  Buffer Full Interrupt Mask         */
    uint32_t NACK:1;           /*!< bit:     13  Non Acknowledge Interrupt Mask     */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t RIIC:1;           /*!< bit:     16  Ring Indicator Input Change Mask   */
    uint32_t DSRIC:1;          /*!< bit:     17  Data Set Ready Input Change Mask   */
    uint32_t DCDIC:1;          /*!< bit:     18  Data Carrier Detect Input Change Interrupt Mask */
    uint32_t CTSIC:1;          /*!< bit:     19  Clear to Send Input Change Interrupt Mask */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } SPI_SLAVE;                 /*!< Structure used for SPI_SLAVE                    */
  struct { // USART mode
    uint32_t RXRDY:1;          /*!< bit:      0  RXRDY Interrupt Mask               */
    uint32_t TXRDY:1;          /*!< bit:      1  TXRDY Interrupt Mask               */
    uint32_t RXBRK:1;          /*!< bit:      2  Receiver Break Interrupt Mask      */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t OVRE:1;           /*!< bit:      5  Overrun Error Interrupt Mask       */
    uint32_t FRAME:1;          /*!< bit:      6  Framing Error Interrupt Mask       */
    uint32_t PARE:1;           /*!< bit:      7  Parity Error Interrupt Mask        */
    uint32_t TIMEOUT:1;        /*!< bit:      8  Time-out Interrupt Mask            */
    uint32_t TXEMPTY:1;        /*!< bit:      9  TXEMPTY Interrupt Mask             */
    uint32_t ITER:1;           /*!< bit:     10  Iteration Interrupt Mask           */
    uint32_t TXBUFE:1;         /*!< bit:     11  Buffer Empty Interrupt Mask        */
    uint32_t RXBUFF:1;         /*!< bit:     12  Buffer Full Interrupt Mask         */
    uint32_t NACK:1;           /*!< bit:     13  Non Acknowledge Interrupt Mask     */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t RIIC:1;           /*!< bit:     16  Ring Indicator Input Change Mask   */
    uint32_t DSRIC:1;          /*!< bit:     17  Data Set Ready Input Change Mask   */
    uint32_t DCDIC:1;          /*!< bit:     18  Data Carrier Detect Input Change Interrupt Mask */
    uint32_t CTSIC:1;          /*!< bit:     19  Clear to Send Input Change Interrupt Mask */
    uint32_t MANE:1;           /*!< bit:     20  Manchester Error Interrupt Mask    */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t MANEA:1;          /*!< bit:     24  Manchester Error Interrupt Mask    */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } USART;                     /*!< Structure used for USART                        */
  uint32_t reg;                /*!< Type      used for register access              */
} US_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_IMR_OFFSET               0x10         /**< \brief (US_IMR offset) Interrupt Mask Register */
#define US_IMR_RESETVALUE           _U(0x00000000); /**< \brief (US_IMR reset_value) Interrupt Mask Register */

