frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// USART mode
#define US_IMR_USART_RXRDY_Pos      0            /**< \brief (US_IMR_USART) RXRDY Interrupt Mask */
#define US_IMR_USART_RXRDY          (_U(0x1) << US_IMR_USART_RXRDY_Pos)
#define   US_IMR_USART_RXRDY_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RXRDY_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RXRDY_0        (US_IMR_USART_RXRDY_0_Val      << US_IMR_USART_RXRDY_Pos)
#define US_IMR_USART_RXRDY_1        (US_IMR_USART_RXRDY_1_Val      << US_IMR_USART_RXRDY_Pos)
#define US_IMR_USART_TXRDY_Pos      1            /**< \brief (US_IMR_USART) TXRDY Interrupt Mask */
#define US_IMR_USART_TXRDY          (_U(0x1) << US_IMR_USART_TXRDY_Pos)
#define   US_IMR_USART_TXRDY_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TXRDY_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TXRDY_0        (US_IMR_USART_TXRDY_0_Val      << US_IMR_USART_TXRDY_Pos)
#define US_IMR_USART_TXRDY_1        (US_IMR_USART_TXRDY_1_Val      << US_IMR_USART_TXRDY_Pos)
#define US_IMR_USART_RXBRK_Pos      2            /**< \brief (US_IMR_USART) Receiver Break Interrupt Mask */
#define US_IMR_USART_RXBRK          (_U(0x1) << US_IMR_USART_RXBRK_Pos)
#define   US_IMR_USART_RXBRK_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RXBRK_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RXBRK_0        (US_IMR_USART_RXBRK_0_Val      << US_IMR_USART_RXBRK_Pos)
#define US_IMR_USART_RXBRK_1        (US_IMR_USART_RXBRK_1_Val      << US_IMR_USART_RXBRK_Pos)
#define US_IMR_USART_OVRE_Pos       5            /**< \brief (US_IMR_USART) Overrun Error Interrupt Mask */
#define US_IMR_USART_OVRE           (_U(0x1) << US_IMR_USART_OVRE_Pos)
#define   US_IMR_USART_OVRE_0_Val         _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_OVRE_1_Val         _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_OVRE_0         (US_IMR_USART_OVRE_0_Val       << US_IMR_USART_OVRE_Pos)
#define US_IMR_USART_OVRE_1         (US_IMR_USART_OVRE_1_Val       << US_IMR_USART_OVRE_Pos)
#define US_IMR_USART_FRAME_Pos      6            /**< \brief (US_IMR_USART) Framing Error Interrupt Mask */
#define US_IMR_USART_FRAME          (_U(0x1) << US_IMR_USART_FRAME_Pos)
#define   US_IMR_USART_FRAME_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_FRAME_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_FRAME_0        (US_IMR_USART_FRAME_0_Val      << US_IMR_USART_FRAME_Pos)
#define US_IMR_USART_FRAME_1        (US_IMR_USART_FRAME_1_Val      << US_IMR_USART_FRAME_Pos)
#define US_IMR_USART_PARE_Pos       7            /**< \brief (US_IMR_USART) Parity Error Interrupt Mask */
#define US_IMR_USART_PARE           (_U(0x1) << US_IMR_USART_PARE_Pos)
#define   US_IMR_USART_PARE_0_Val         _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_PARE_1_Val         _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_PARE_0         (US_IMR_USART_PARE_0_Val       << US_IMR_USART_PARE_Pos)
#define US_IMR_USART_PARE_1         (US_IMR_USART_PARE_1_Val       << US_IMR_USART_PARE_Pos)
#define US_IMR_USART_TIMEOUT_Pos    8            /**< \brief (US_IMR_USART) Time-out Interrupt Mask */
#define US_IMR_USART_TIMEOUT        (_U(0x1) << US_IMR_USART_TIMEOUT_Pos)
#define   US_IMR_USART_TIMEOUT_0_Val      _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TIMEOUT_1_Val      _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TIMEOUT_0      (US_IMR_USART_TIMEOUT_0_Val    << US_IMR_USART_TIMEOUT_Pos)
#define US_IMR_USART_TIMEOUT_1      (US_IMR_USART_TIMEOUT_1_Val    << US_IMR_USART_TIMEOUT_Pos)
#define US_IMR_USART_TXEMPTY_Pos    9            /**< \brief (US_IMR_USART) TXEMPTY Interrupt Mask */
#define US_IMR_USART_TXEMPTY        (_U(0x1) << US_IMR_USART_TXEMPTY_Pos)
#define   US_IMR_USART_TXEMPTY_0_Val      _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TXEMPTY_1_Val      _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TXEMPTY_0      (US_IMR_USART_TXEMPTY_0_Val    << US_IMR_USART_TXEMPTY_Pos)
#define US_IMR_USART_TXEMPTY_1      (US_IMR_USART_TXEMPTY_1_Val    << US_IMR_USART_TXEMPTY_Pos)
#define US_IMR_USART_ITER_Pos       10           /**< \brief (US_IMR_USART) Iteration Interrupt Mask */
#define US_IMR_USART_ITER           (_U(0x1) << US_IMR_USART_ITER_Pos)
#define   US_IMR_USART_ITER_0_Val         _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_ITER_1_Val         _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_ITER_0         (US_IMR_USART_ITER_0_Val       << US_IMR_USART_ITER_Pos)
#define US_IMR_USART_ITER_1         (US_IMR_USART_ITER_1_Val       << US_IMR_USART_ITER_Pos)
#define US_IMR_USART_TXBUFE_Pos     11           /**< \brief (US_IMR_USART) Buffer Empty Interrupt Mask */
#define US_IMR_USART_TXBUFE         (_U(0x1) << US_IMR_USART_TXBUFE_Pos)
#define   US_IMR_USART_TXBUFE_0_Val       _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_TXBUFE_1_Val       _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_TXBUFE_0       (US_IMR_USART_TXBUFE_0_Val     << US_IMR_USART_TXBUFE_Pos)
#define US_IMR_USART_TXBUFE_1       (US_IMR_USART_TXBUFE_1_Val     << US_IMR_USART_TXBUFE_Pos)
#define US_IMR_USART_RXBUFF_Pos     12           /**< \brief (US_IMR_USART) Buffer Full Interrupt Mask */
#define US_IMR_USART_RXBUFF         (_U(0x1) << US_IMR_USART_RXBUFF_Pos)
#define   US_IMR_USART_RXBUFF_0_Val       _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RXBUFF_1_Val       _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RXBUFF_0       (US_IMR_USART_RXBUFF_0_Val     << US_IMR_USART_RXBUFF_Pos)
#define US_IMR_USART_RXBUFF_1       (US_IMR_USART_RXBUFF_1_Val     << US_IMR_USART_RXBUFF_Pos)
#define US_IMR_USART_NACK_Pos       13           /**< \brief (US_IMR_USART) Non Acknowledge Interrupt Mask */
#define US_IMR_USART_NACK           (_U(0x1) << US_IMR_USART_NACK_Pos)
#define   US_IMR_USART_NACK_0_Val         _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_NACK_1_Val         _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_NACK_0         (US_IMR_USART_NACK_0_Val       << US_IMR_USART_NACK_Pos)
#define US_IMR_USART_NACK_1         (US_IMR_USART_NACK_1_Val       << US_IMR_USART_NACK_Pos)
#define US_IMR_USART_RIIC_Pos       16           /**< \brief (US_IMR_USART) Ring Indicator Input Change Mask */
#define US_IMR_USART_RIIC           (_U(0x1) << US_IMR_USART_RIIC_Pos)
#define   US_IMR_USART_RIIC_0_Val         _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_RIIC_1_Val         _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_RIIC_0         (US_IMR_USART_RIIC_0_Val       << US_IMR_USART_RIIC_Pos)
#define US_IMR_USART_RIIC_1         (US_IMR_USART_RIIC_1_Val       << US_IMR_USART_RIIC_Pos)
#define US_IMR_USART_DSRIC_Pos      17           /**< \brief (US_IMR_USART) Data Set Ready Input Change Mask */
#define US_IMR_USART_DSRIC          (_U(0x1) << US_IMR_USART_DSRIC_Pos)
#define   US_IMR_USART_DSRIC_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_DSRIC_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_DSRIC_0        (US_IMR_USART_DSRIC_0_Val      << US_IMR_USART_DSRIC_Pos)
#define US_IMR_USART_DSRIC_1        (US_IMR_USART_DSRIC_1_Val      << US_IMR_USART_DSRIC_Pos)
#define US_IMR_USART_DCDIC_Pos      18           /**< \brief (US_IMR_USART) Data Carrier Detect Input Change Interrupt Mask */
#define US_IMR_USART_DCDIC          (_U(0x1) << US_IMR_USART_DCDIC_Pos)
#define   US_IMR_USART_DCDIC_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_DCDIC_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_DCDIC_0        (US_IMR_USART_DCDIC_0_Val      << US_IMR_USART_DCDIC_Pos)
#define US_IMR_USART_DCDIC_1        (US_IMR_USART_DCDIC_1_Val      << US_IMR_USART_DCDIC_Pos)
#define US_IMR_USART_CTSIC_Pos      19           /**< \brief (US_IMR_USART) Clear to Send Input Change Interrupt Mask */
#define US_IMR_USART_CTSIC          (_U(0x1) << US_IMR_USART_CTSIC_Pos)
#define   US_IMR_USART_CTSIC_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_CTSIC_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_CTSIC_0        (US_IMR_USART_CTSIC_0_Val      << US_IMR_USART_CTSIC_Pos)
#define US_IMR_USART_CTSIC_1        (US_IMR_USART_CTSIC_1_Val      << US_IMR_USART_CTSIC_Pos)
#define US_IMR_USART_MANE_Pos       20           /**< \brief (US_IMR_USART) Manchester Error Interrupt Mask */
#define US_IMR_USART_MANE           (_U(0x1) << US_IMR_USART_MANE_Pos)
#define US_IMR_USART_MANEA_Pos      24           /**< \brief (US_IMR_USART) Manchester Error Interrupt Mask */
#define US_IMR_USART_MANEA          (_U(0x1) << US_IMR_USART_MANEA_Pos)
#define   US_IMR_USART_MANEA_0_Val        _U(0x0)   /**< \brief (US_IMR_USART) The interrupt is disabled */
#define   US_IMR_USART_MANEA_1_Val        _U(0x1)   /**< \brief (US_IMR_USART) The interrupt is enabled */
#define US_IMR_USART_MANEA_0        (US_IMR_USART_MANEA_0_Val      << US_IMR_USART_MANEA_Pos)
#define US_IMR_USART_MANEA_1        (US_IMR_USART_MANEA_1_Val      << US_IMR_USART_MANEA_Pos)
#define US_IMR_USART_MASK           _U(0x011F3FE7) /**< \brief (US_IMR_USART) MASK Register */

// Any mode
#define US_IMR_RXRDY_Pos            0            /**< \brief (US_IMR) RXRDY Interrupt Mask */
#define US_IMR_RXRDY                (_U(0x1) << US_IMR_RXRDY_Pos)
#define   US_IMR_RXRDY_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RXRDY_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_RXRDY_0              (US_IMR_RXRDY_0_Val            << US_IMR_RXRDY_Pos)
#define US_IMR_RXRDY_1              (US_IMR_RXRDY_1_Val            << US_IMR_RXRDY_Pos)
#define US_IMR_TXRDY_Pos            1            /**< \brief (US_IMR) TXRDY Interrupt Mask */
#define US_IMR_TXRDY                (_U(0x1) << US_IMR_TXRDY_Pos)
#define   US_IMR_TXRDY_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TXRDY_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TXRDY_0              (US_IMR_TXRDY_0_Val            << US_IMR_TXRDY_Pos)
#define US_IMR_TXRDY_1              (US_IMR_TXRDY_1_Val            << US_IMR_TXRDY_Pos)
#define US_IMR_RXBRK_Pos            2            /**< \brief (US_IMR) Receiver Break Interrupt Mask */
#define US_IMR_RXBRK                (_U(0x1) << US_IMR_RXBRK_Pos)
#define   US_IMR_RXBRK_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RXBRK_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_RXBRK_0              (US_IMR_RXBRK_0_Val            << US_IMR_RXBRK_Pos)
#define US_IMR_RXBRK_1              (US_IMR_RXBRK_1_Val            << US_IMR_RXBRK_Pos)
#define US_IMR_OVRE_Pos             5            /**< \brief (US_IMR) Overrun Error Interrupt Mask */
#define US_IMR_OVRE                 (_U(0x1) << US_IMR_OVRE_Pos)
#define   US_IMR_OVRE_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_OVRE_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_OVRE_0               (US_IMR_OVRE_0_Val             << US_IMR_OVRE_Pos)
#define US_IMR_OVRE_1               (US_IMR_OVRE_1_Val             << US_IMR_OVRE_Pos)
#define US_IMR_FRAME_Pos            6            /**< \brief (US_IMR) Framing Error Interrupt Mask */
#define US_IMR_FRAME                (_U(0x1) << US_IMR_FRAME_Pos)
#define   US_IMR_FRAME_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_FRAME_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_FRAME_0              (US_IMR_FRAME_0_Val            << US_IMR_FRAME_Pos)
#define US_IMR_FRAME_1              (US_IMR_FRAME_1_Val            << US_IMR_FRAME_Pos)
#define US_IMR_PARE_Pos             7            /**< \brief (US_IMR) Parity Error Interrupt Mask */
#define US_IMR_PARE                 (_U(0x1) << US_IMR_PARE_Pos)
#define   US_IMR_PARE_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_PARE_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_PARE_0               (US_IMR_PARE_0_Val             << US_IMR_PARE_Pos)
#define US_IMR_PARE_1               (US_IMR_PARE_1_Val             << US_IMR_PARE_Pos)
#define US_IMR_TIMEOUT_Pos          8            /**< \brief (US_IMR) Time-out Interrupt Mask */
#define US_IMR_TIMEOUT              (_U(0x1) << US_IMR_TIMEOUT_Pos)
#define   US_IMR_TIMEOUT_0_Val            _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TIMEOUT_1_Val            _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TIMEOUT_0            (US_IMR_TIMEOUT_0_Val          << US_IMR_TIMEOUT_Pos)
#define US_IMR_TIMEOUT_1            (US_IMR_TIMEOUT_1_Val          << US_IMR_TIMEOUT_Pos)
#define US_IMR_TXEMPTY_Pos          9            /**< \brief (US_IMR) TXEMPTY Interrupt Mask */
#define US_IMR_TXEMPTY              (_U(0x1) << US_IMR_TXEMPTY_Pos)
#define   US_IMR_TXEMPTY_0_Val            _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TXEMPTY_1_Val            _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TXEMPTY_0            (US_IMR_TXEMPTY_0_Val          << US_IMR_TXEMPTY_Pos)
#define US_IMR_TXEMPTY_1            (US_IMR_TXEMPTY_1_Val          << US_IMR_TXEMPTY_Pos)
#define US_IMR_ITER_Pos             10           /**< \brief (US_IMR) Iteration Interrupt Mask */
#define US_IMR_ITER                 (_U(0x1) << US_IMR_ITER_Pos)
#define   US_IMR_ITER_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_ITER_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_ITER_0               (US_IMR_ITER_0_Val             << US_IMR_ITER_Pos)
#define US_IMR_ITER_1               (US_IMR_ITER_1_Val             << US_IMR_ITER_Pos)
#define US_IMR_UNRE_Pos             10           /**< \brief (US_IMR) SPI Underrun Error Interrupt Mask */
#define US_IMR_UNRE                 (_U(0x1) << US_IMR_UNRE_Pos)
#define   US_IMR_UNRE_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_UNRE_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_UNRE_0               (US_IMR_UNRE_0_Val             << US_IMR_UNRE_Pos)
#define US_IMR_UNRE_1               (US_IMR_UNRE_1_Val             << US_IMR_UNRE_Pos)
#define US_IMR_ITER_Pos             10           /**< \brief (US_IMR) Iteration Interrupt Mask */
#define US_IMR_ITER                 (_U(0x1) << US_IMR_ITER_Pos)
#define   US_IMR_ITER_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_ITER_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_ITER_0               (US_IMR_ITER_0_Val             << US_IMR_ITER_Pos)
#define US_IMR_ITER_1               (US_IMR_ITER_1_Val             << US_IMR_ITER_Pos)
#define US_IMR_TXBUFE_Pos           11           /**< \brief (US_IMR) Buffer Empty Interrupt Mask */
#define US_IMR_TXBUFE               (_U(0x1) << US_IMR_TXBUFE_Pos)
#define   US_IMR_TXBUFE_0_Val             _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_TXBUFE_1_Val             _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_TXBUFE_0             (US_IMR_TXBUFE_0_Val           << US_IMR_TXBUFE_Pos)
#define US_IMR_TXBUFE_1             (US_IMR_TXBUFE_1_Val           << US_IMR_TXBUFE_Pos)
#define US_IMR_RXBUFF_Pos           12           /**< \brief (US_IMR) Buffer Full Interrupt Mask */
#define US_IMR_RXBUFF               (_U(0x1) << US_IMR_RXBUFF_Pos)
#define   US_IMR_RXBUFF_0_Val             _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RXBUFF_1_Val             _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_RXBUFF_0             (US_IMR_RXBUFF_0_Val           << US_IMR_RXBUFF_Pos)
#define US_IMR_RXBUFF_1             (US_IMR_RXBUFF_1_Val           << US_IMR_RXBUFF_Pos)
#define US_IMR_NACK_Pos             13           /**< \brief (US_IMR) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Mask */
#define US_IMR_NACK                 (_U(0x1) << US_IMR_NACK_Pos)
#define   US_IMR_NACK_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_NACK_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_NACK_0               (US_IMR_NACK_0_Val             << US_IMR_NACK_Pos)
#define US_IMR_NACK_1               (US_IMR_NACK_1_Val             << US_IMR_NACK_Pos)
#define US_IMR_LINID_Pos            14           /**< \brief (US_IMR) LIN Identifier Sent or LIN Received Interrupt Mask */
#define US_IMR_LINID                (_U(0x1) << US_IMR_LINID_Pos)
#define US_IMR_LINTC_Pos            15           /**< \brief (US_IMR) LIN Transfer Conpleted Interrupt Mask */
#define US_IMR_LINTC                (_U(0x1) << US_IMR_LINTC_Pos)
#define US_IMR_RIIC_Pos             16           /**< \brief (US_IMR) Ring Indicator Input Change Mask */
#define US_IMR_RIIC                 (_U(0x1) << US_IMR_RIIC_Pos)
#define   US_IMR_RIIC_0_Val               _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_RIIC_1_Val               _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_RIIC_0               (US_IMR_RIIC_0_Val             << US_IMR_RIIC_Pos)
#define US_IMR_RIIC_1               (US_IMR_RIIC_1_Val             << US_IMR_RIIC_Pos)
#define US_IMR_DSRIC_Pos            17           /**< \brief (US_IMR) Data Set Ready Input Change Mask */
#define US_IMR_DSRIC                (_U(0x1) << US_IMR_DSRIC_Pos)
#define   US_IMR_DSRIC_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_DSRIC_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_DSRIC_0              (US_IMR_DSRIC_0_Val            << US_IMR_DSRIC_Pos)
#define US_IMR_DSRIC_1              (US_IMR_DSRIC_1_Val            << US_IMR_DSRIC_Pos)
#define US_IMR_DCDIC_Pos            18           /**< \brief (US_IMR) Data Carrier Detect Input Change Interrupt Mask */
#define US_IMR_DCDIC                (_U(0x1) << US_IMR_DCDIC_Pos)
#define   US_IMR_DCDIC_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_DCDIC_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_DCDIC_0              (US_IMR_DCDIC_0_Val            << US_IMR_DCDIC_Pos)
#define US_IMR_DCDIC_1              (US_IMR_DCDIC_1_Val            << US_IMR_DCDIC_Pos)
#define US_IMR_CTSIC_Pos            19           /**< \brief (US_IMR) Clear to Send Input Change Interrupt Mask */
#define US_IMR_CTSIC                (_U(0x1) << US_IMR_CTSIC_Pos)
#define   US_IMR_CTSIC_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_CTSIC_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_CTSIC_0              (US_IMR_CTSIC_0_Val            << US_IMR_CTSIC_Pos)
#define US_IMR_CTSIC_1              (US_IMR_CTSIC_1_Val            << US_IMR_CTSIC_Pos)
#define US_IMR_MANE_Pos             20           /**< \brief (US_IMR) Manchester Error Interrupt Mask */
#define US_IMR_MANE                 (_U(0x1) << US_IMR_MANE_Pos)
#define US_IMR_MANEA_Pos            24           /**< \brief (US_IMR) Manchester Error Interrupt Mask */
#define US_IMR_MANEA                (_U(0x1) << US_IMR_MANEA_Pos)
#define   US_IMR_MANEA_0_Val              _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_MANEA_1_Val              _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_MANEA_0              (US_IMR_MANEA_0_Val            << US_IMR_MANEA_Pos)
#define US_IMR_MANEA_1              (US_IMR_MANEA_1_Val            << US_IMR_MANEA_Pos)
#define US_IMR_LINBE_Pos            25           /**< \brief (US_IMR) LIN Bus Error Interrupt Mask */
#define US_IMR_LINBE                (_U(0x1) << US_IMR_LINBE_Pos)
#define US_IMR_LINISFE_Pos          26           /**< \brief (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask */
#define US_IMR_LINISFE              (_U(0x1) << US_IMR_LINISFE_Pos)
#define US_IMR_LINIPE_Pos           27           /**< \brief (US_IMR) LIN Identifier Parity Interrupt Mask */
#define US_IMR_LINIPE               (_U(0x1) << US_IMR_LINIPE_Pos)
#define US_IMR_LINCE_Pos            28           /**< \brief (US_IMR) LIN Checksum Error Interrupt Mask */
#define US_IMR_LINCE                (_U(0x1) << US_IMR_LINCE_Pos)
#define US_IMR_LINSNRE_Pos          29           /**< \brief (US_IMR) LIN Slave Not Responding Error Interrupt Mask */
#define US_IMR_LINSNRE              (_U(0x1) << US_IMR_LINSNRE_Pos)
#define US_IMR_LINSTE_Pos           30           /**< \brief (US_IMR) LIN Synch Tolerance Error Interrupt Mask */
#define US_IMR_LINSTE               (_U(0x1) << US_IMR_LINSTE_Pos)
#define   US_IMR_LINSTE_0_Val             _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_LINSTE_1_Val             _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_LINSTE_0             (US_IMR_LINSTE_0_Val           << US_IMR_LINSTE_Pos)
#define US_IMR_LINSTE_1             (US_IMR_LINSTE_1_Val           << US_IMR_LINSTE_Pos)
#define US_IMR_LINHTE_Pos           31           /**< \brief (US_IMR) LIN Header Timeout Error Interrupt Mask */
#define US_IMR_LINHTE               (_U(0x1) << US_IMR_LINHTE_Pos)
#define   US_IMR_LINHTE_0_Val             _U(0x0)   /**< \brief (US_IMR) The interrupt is disabled */
#define   US_IMR_LINHTE_1_Val             _U(0x1)   /**< \brief (US_IMR) The interrupt is enabled */
#define US_IMR_LINHTE_0             (US_IMR_LINHTE_0_Val           << US_IMR_LINHTE_Pos)
#define US_IMR_LINHTE_1             (US_IMR_LINHTE_1_Val           << US_IMR_LINHTE_Pos)
#define US_IMR_MASK                 _U(0xFF1FFFE7) /**< \brief (US_IMR) MASK Register */

