frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
/* -------- US_CSR : (USART Offset: 0x14) (R/  32) Channel Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct { // LIN mode
    uint32_t RXRDY:1;          /*!< bit:      0  Receiver Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmitter Ready                  */
    uint32_t RXBRK:1;          /*!< bit:      2  Break Received/End of Break        */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t OVRE:1;           /*!< bit:      5  Overrun Error                      */
    uint32_t FRAME:1;          /*!< bit:      6  Framing Error                      */
    uint32_t PARE:1;           /*!< bit:      7  Parity Error                       */
    uint32_t TIMEOUT:1;        /*!< bit:      8  Receiver Time-out                  */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmitter Empty                  */
    uint32_t ITER:1;           /*!< bit:     10  Max number of Repetitions Reached  */
    uint32_t TXBUFE:1;         /*!< bit:     11  Transmission Buffer Empty          */
    uint32_t RXBUFF:1;         /*!< bit:     12  Reception Buffer Full              */
    uint32_t NACK:1;           /*!< bit:     13  Non Acknowledge or LIN Break Sent or LIN Break Received */
    uint32_t LINID:1;          /*!< bit:     14  LIN Identifier Sent or LIN Identifier Received */
    uint32_t LINTC:1;          /*!< bit:     15  LIN Transfer Conpleted             */
    uint32_t RIIC:1;           /*!< bit:     16  Ring Indicator Input Change Flag   */
    uint32_t DSRIC:1;          /*!< bit:     17  Data Set Ready Input Change Flag   */
    uint32_t DCDIC:1;          /*!< bit:     18  Data Carrier Detect Input Change Flag */
    uint32_t CTSIC:1;          /*!< bit:     19  Clear to Send Input Change Flag    */
    uint32_t RI:1;             /*!< bit:     20  Image of RI Input                  */
    uint32_t DSR:1;            /*!< bit:     21  Image of DSR Input                 */
    uint32_t DCD:1;            /*!< bit:     22  Image of DCD Input                 */
    uint32_t LINBLS:1;         /*!< bit:     23  LIN Bus Line Status                */
    uint32_t :1;               /*!< bit:     24  Reserved                           */
    uint32_t LINBE:1;          /*!< bit:     25  LIN Bit Error                      */
    uint32_t LINISFE:1;        /*!< bit:     26  LIN Inconsistent Synch Field Error */
    uint32_t LINIPE:1;         /*!< bit:     27  LIN Identifier Parity Error        */
    uint32_t LINCE:1;          /*!< bit:     28  LIN Checksum Error                 */
    uint32_t LINSNRE:1;        /*!< bit:     29  LIN Slave Not Responding Error     */
    uint32_t LINSTE:1;         /*!< bit:     30  LIN Synch Tolerance Error          */
    uint32_t LINHTE:1;         /*!< bit:     31  LIN Header Timeout Error           */
  } LIN;                       /*!< Structure used for LIN                          */
  struct { // SPI_SLAVE mode
    uint32_t RXRDY:1;          /*!< bit:      0  Receiver Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmitter Ready                  */
    uint32_t RXBRK:1;          /*!< bit:      2  Break Received/End of Break        */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t OVRE:1;           /*!< bit:      5  Overrun Error                      */
    uint32_t FRAME:1;          /*!< bit:      6  Framing Error                      */
    uint32_t PARE:1;           /*!< bit:      7  Parity Error                       */
    uint32_t TIMEOUT:1;        /*!< bit:      8  Receiver Time-out                  */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmitter Empty                  */
    uint32_t UNRE:1;           /*!< bit:     10  SPI Underrun Error                 */
    uint32_t TXBUFE:1;         /*!< bit:     11  Transmission Buffer Empty          */
    uint32_t RXBUFF:1;         /*!< bit:     12  Reception Buffer Full              */
    uint32_t NACK:1;           /*!< bit:     13  Non Acknowledge                    */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t RIIC:1;           /*!< bit:     16  Ring Indicator Input Change Flag   */
    uint32_t DSRIC:1;          /*!< bit:     17  Data Set Ready Input Change Flag   */
    uint32_t DCDIC:1;          /*!< bit:     18  Data Carrier Detect Input Change Flag */
    uint32_t CTSIC:1;          /*!< bit:     19  Clear to Send Input Change Flag    */
    uint32_t RI:1;             /*!< bit:     20  Image of RI Input                  */
    uint32_t DSR:1;            /*!< bit:     21  Image of DSR Input                 */
    uint32_t DCD:1;            /*!< bit:     22  Image of DCD Input                 */
    uint32_t CTS:1;            /*!< bit:     23  Image of CTS Input                 */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } SPI_SLAVE;                 /*!< Structure used for SPI_SLAVE                    */
  struct { // USART mode
    uint32_t RXRDY:1;          /*!< bit:      0  Receiver Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmitter Ready                  */
    uint32_t RXBRK:1;          /*!< bit:      2  Break Received/End of Break        */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t OVRE:1;           /*!< bit:      5  Overrun Error                      */
    uint32_t FRAME:1;          /*!< bit:      6  Framing Error                      */
    uint32_t PARE:1;           /*!< bit:      7  Parity Error                       */
    uint32_t TIMEOUT:1;        /*!< bit:      8  Receiver Time-out                  */
    uint32_t TXEMPTY:1;        /*!< bit:      9  Transmitter Empty                  */
    uint32_t ITER:1;           /*!< bit:     10  Max number of Repetitions Reached  */
    uint32_t TXBUFE:1;         /*!< bit:     11  Transmission Buffer Empty          */
    uint32_t RXBUFF:1;         /*!< bit:     12  Reception Buffer Full              */
    uint32_t NACK:1;           /*!< bit:     13  Non Acknowledge                    */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t RIIC:1;           /*!< bit:     16  Ring Indicator Input Change Flag   */
    uint32_t DSRIC:1;          /*!< bit:     17  Data Set Ready Input Change Flag   */
    uint32_t DCDIC:1;          /*!< bit:     18  Data Carrier Detect Input Change Flag */
    uint32_t CTSIC:1;          /*!< bit:     19  Clear to Send Input Change Flag    */
    uint32_t RI:1;             /*!< bit:     20  Image of RI Input                  */
    uint32_t DSR:1;            /*!< bit:     21  Image of DSR Input                 */
    uint32_t DCD:1;            /*!< bit:     22  Image of DCD Input                 */
    uint32_t CTS:1;            /*!< bit:     23  Image of CTS Input                 */
    uint32_t MANERR:1;         /*!< bit:     24  Manchester Error                   */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } USART;                     /*!< Structure used for USART                        */
  uint32_t reg;                /*!< Type      used for register access              */
} US_CSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_CSR_OFFSET               0x14         /**< \brief (US_CSR offset) Channel Status Register */
#define US_CSR_RESETVALUE           _U(0x00000000); /**< \brief (US_CSR reset_value) Channel Status Register */

