frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
// USART mode
#define US_CSR_USART_RXRDY_Pos      0            /**< \brief (US_CSR_USART) Receiver Ready */
#define US_CSR_USART_RXRDY          (_U(0x1) << US_CSR_USART_RXRDY_Pos)
#define   US_CSR_USART_RXRDY_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_USART_RXRDY_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_USART_RXRDY_0        (US_CSR_USART_RXRDY_0_Val      << US_CSR_USART_RXRDY_Pos)
#define US_CSR_USART_RXRDY_1        (US_CSR_USART_RXRDY_1_Val      << US_CSR_USART_RXRDY_Pos)
#define US_CSR_USART_TXRDY_Pos      1            /**< \brief (US_CSR_USART) Transmitter Ready */
#define US_CSR_USART_TXRDY          (_U(0x1) << US_CSR_USART_TXRDY_Pos)
#define   US_CSR_USART_TXRDY_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_USART_TXRDY_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) There is no character in the THR */
#define US_CSR_USART_TXRDY_0        (US_CSR_USART_TXRDY_0_Val      << US_CSR_USART_TXRDY_Pos)
#define US_CSR_USART_TXRDY_1        (US_CSR_USART_TXRDY_1_Val      << US_CSR_USART_TXRDY_Pos)
#define US_CSR_USART_RXBRK_Pos      2            /**< \brief (US_CSR_USART) Break Received/End of Break */
#define US_CSR_USART_RXBRK          (_U(0x1) << US_CSR_USART_RXBRK_Pos)
#define   US_CSR_USART_RXBRK_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_USART_RXBRK_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_USART_RXBRK_0        (US_CSR_USART_RXBRK_0_Val      << US_CSR_USART_RXBRK_Pos)
#define US_CSR_USART_RXBRK_1        (US_CSR_USART_RXBRK_1_Val      << US_CSR_USART_RXBRK_Pos)
#define US_CSR_USART_OVRE_Pos       5            /**< \brief (US_CSR_USART) Overrun Error */
#define US_CSR_USART_OVRE           (_U(0x1) << US_CSR_USART_OVRE_Pos)
#define   US_CSR_USART_OVRE_0_Val         _U(0x0)   /**< \brief (US_CSR_USART) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_USART_OVRE_1_Val         _U(0x1)   /**< \brief (US_CSR_USART) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_USART_OVRE_0         (US_CSR_USART_OVRE_0_Val       << US_CSR_USART_OVRE_Pos)
#define US_CSR_USART_OVRE_1         (US_CSR_USART_OVRE_1_Val       << US_CSR_USART_OVRE_Pos)
#define US_CSR_USART_FRAME_Pos      6            /**< \brief (US_CSR_USART) Framing Error */
#define US_CSR_USART_FRAME          (_U(0x1) << US_CSR_USART_FRAME_Pos)
#define   US_CSR_USART_FRAME_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_USART_FRAME_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_USART_FRAME_0        (US_CSR_USART_FRAME_0_Val      << US_CSR_USART_FRAME_Pos)
#define US_CSR_USART_FRAME_1        (US_CSR_USART_FRAME_1_Val      << US_CSR_USART_FRAME_Pos)
#define US_CSR_USART_PARE_Pos       7            /**< \brief (US_CSR_USART) Parity Error */
#define US_CSR_USART_PARE           (_U(0x1) << US_CSR_USART_PARE_Pos)
#define   US_CSR_USART_PARE_0_Val         _U(0x0)   /**< \brief (US_CSR_USART) No parity error has been detected since the last RSTSTA */
#define   US_CSR_USART_PARE_1_Val         _U(0x1)   /**< \brief (US_CSR_USART) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_USART_PARE_0         (US_CSR_USART_PARE_0_Val       << US_CSR_USART_PARE_Pos)
#define US_CSR_USART_PARE_1         (US_CSR_USART_PARE_1_Val       << US_CSR_USART_PARE_Pos)
#define US_CSR_USART_TIMEOUT_Pos    8            /**< \brief (US_CSR_USART) Receiver Time-out */
#define US_CSR_USART_TIMEOUT        (_U(0x1) << US_CSR_USART_TIMEOUT_Pos)
#define   US_CSR_USART_TIMEOUT_0_Val      _U(0x0)   /**< \brief (US_CSR_USART) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_USART_TIMEOUT_1_Val      _U(0x1)   /**< \brief (US_CSR_USART) There has been a time-out since the last Start Time-out command */
#define US_CSR_USART_TIMEOUT_0      (US_CSR_USART_TIMEOUT_0_Val    << US_CSR_USART_TIMEOUT_Pos)
#define US_CSR_USART_TIMEOUT_1      (US_CSR_USART_TIMEOUT_1_Val    << US_CSR_USART_TIMEOUT_Pos)
#define US_CSR_USART_TXEMPTY_Pos    9            /**< \brief (US_CSR_USART) Transmitter Empty */
#define US_CSR_USART_TXEMPTY        (_U(0x1) << US_CSR_USART_TXEMPTY_Pos)
#define   US_CSR_USART_TXEMPTY_0_Val      _U(0x0)   /**< \brief (US_CSR_USART) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_USART_TXEMPTY_1_Val      _U(0x1)   /**< \brief (US_CSR_USART) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_USART_TXEMPTY_0      (US_CSR_USART_TXEMPTY_0_Val    << US_CSR_USART_TXEMPTY_Pos)
#define US_CSR_USART_TXEMPTY_1      (US_CSR_USART_TXEMPTY_1_Val    << US_CSR_USART_TXEMPTY_Pos)
#define US_CSR_USART_ITER_Pos       10           /**< \brief (US_CSR_USART) Max number of Repetitions Reached */
#define US_CSR_USART_ITER           (_U(0x1) << US_CSR_USART_ITER_Pos)
#define   US_CSR_USART_ITER_0_Val         _U(0x0)   /**< \brief (US_CSR_USART) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_USART_ITER_1_Val         _U(0x1)   /**< \brief (US_CSR_USART) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_USART_ITER_0         (US_CSR_USART_ITER_0_Val       << US_CSR_USART_ITER_Pos)
#define US_CSR_USART_ITER_1         (US_CSR_USART_ITER_1_Val       << US_CSR_USART_ITER_Pos)
#define US_CSR_USART_TXBUFE_Pos     11           /**< \brief (US_CSR_USART) Transmission Buffer Empty */
#define US_CSR_USART_TXBUFE         (_U(0x1) << US_CSR_USART_TXBUFE_Pos)
#define   US_CSR_USART_TXBUFE_0_Val       _U(0x0)   /**< \brief (US_CSR_USART) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_CSR_USART_TXBUFE_1_Val       _U(0x1)   /**< \brief (US_CSR_USART) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_CSR_USART_TXBUFE_0       (US_CSR_USART_TXBUFE_0_Val     << US_CSR_USART_TXBUFE_Pos)
#define US_CSR_USART_TXBUFE_1       (US_CSR_USART_TXBUFE_1_Val     << US_CSR_USART_TXBUFE_Pos)
#define US_CSR_USART_RXBUFF_Pos     12           /**< \brief (US_CSR_USART) Reception Buffer Full */
#define US_CSR_USART_RXBUFF         (_U(0x1) << US_CSR_USART_RXBUFF_Pos)
#define   US_CSR_USART_RXBUFF_0_Val       _U(0x0)   /**< \brief (US_CSR_USART) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_USART_RXBUFF_1_Val       _U(0x1)   /**< \brief (US_CSR_USART) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_USART_RXBUFF_0       (US_CSR_USART_RXBUFF_0_Val     << US_CSR_USART_RXBUFF_Pos)
#define US_CSR_USART_RXBUFF_1       (US_CSR_USART_RXBUFF_1_Val     << US_CSR_USART_RXBUFF_Pos)
#define US_CSR_USART_NACK_Pos       13           /**< \brief (US_CSR_USART) Non Acknowledge */
#define US_CSR_USART_NACK           (_U(0x1) << US_CSR_USART_NACK_Pos)
#define   US_CSR_USART_NACK_0_Val         _U(0x0)   /**< \brief (US_CSR_USART) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_USART_NACK_1_Val         _U(0x1)   /**< \brief (US_CSR_USART) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_USART_NACK_0         (US_CSR_USART_NACK_0_Val       << US_CSR_USART_NACK_Pos)
#define US_CSR_USART_NACK_1         (US_CSR_USART_NACK_1_Val       << US_CSR_USART_NACK_Pos)
#define US_CSR_USART_RIIC_Pos       16           /**< \brief (US_CSR_USART) Ring Indicator Input Change Flag */
#define US_CSR_USART_RIIC           (_U(0x1) << US_CSR_USART_RIIC_Pos)
#define   US_CSR_USART_RIIC_0_Val         _U(0x0)   /**< \brief (US_CSR_USART) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_USART_RIIC_1_Val         _U(0x1)   /**< \brief (US_CSR_USART) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_USART_RIIC_0         (US_CSR_USART_RIIC_0_Val       << US_CSR_USART_RIIC_Pos)
#define US_CSR_USART_RIIC_1         (US_CSR_USART_RIIC_1_Val       << US_CSR_USART_RIIC_Pos)
#define US_CSR_USART_DSRIC_Pos      17           /**< \brief (US_CSR_USART) Data Set Ready Input Change Flag */
#define US_CSR_USART_DSRIC          (_U(0x1) << US_CSR_USART_DSRIC_Pos)
#define   US_CSR_USART_DSRIC_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_USART_DSRIC_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_USART_DSRIC_0        (US_CSR_USART_DSRIC_0_Val      << US_CSR_USART_DSRIC_Pos)
#define US_CSR_USART_DSRIC_1        (US_CSR_USART_DSRIC_1_Val      << US_CSR_USART_DSRIC_Pos)
#define US_CSR_USART_DCDIC_Pos      18           /**< \brief (US_CSR_USART) Data Carrier Detect Input Change Flag */
#define US_CSR_USART_DCDIC          (_U(0x1) << US_CSR_USART_DCDIC_Pos)
#define   US_CSR_USART_DCDIC_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_USART_DCDIC_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_USART_DCDIC_0        (US_CSR_USART_DCDIC_0_Val      << US_CSR_USART_DCDIC_Pos)
#define US_CSR_USART_DCDIC_1        (US_CSR_USART_DCDIC_1_Val      << US_CSR_USART_DCDIC_Pos)
#define US_CSR_USART_CTSIC_Pos      19           /**< \brief (US_CSR_USART) Clear to Send Input Change Flag */
#define US_CSR_USART_CTSIC          (_U(0x1) << US_CSR_USART_CTSIC_Pos)
#define   US_CSR_USART_CTSIC_0_Val        _U(0x0)   /**< \brief (US_CSR_USART) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_USART_CTSIC_1_Val        _U(0x1)   /**< \brief (US_CSR_USART) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_USART_CTSIC_0        (US_CSR_USART_CTSIC_0_Val      << US_CSR_USART_CTSIC_Pos)
#define US_CSR_USART_CTSIC_1        (US_CSR_USART_CTSIC_1_Val      << US_CSR_USART_CTSIC_Pos)
#define US_CSR_USART_RI_Pos         20           /**< \brief (US_CSR_USART) Image of RI Input */
#define US_CSR_USART_RI             (_U(0x1) << US_CSR_USART_RI_Pos)
#define   US_CSR_USART_RI_0_Val           _U(0x0)   /**< \brief (US_CSR_USART) RI is at 0 */
#define   US_CSR_USART_RI_1_Val           _U(0x1)   /**< \brief (US_CSR_USART) RI is at 1 */
#define US_CSR_USART_RI_0           (US_CSR_USART_RI_0_Val         << US_CSR_USART_RI_Pos)
#define US_CSR_USART_RI_1           (US_CSR_USART_RI_1_Val         << US_CSR_USART_RI_Pos)
#define US_CSR_USART_DSR_Pos        21           /**< \brief (US_CSR_USART) Image of DSR Input */
#define US_CSR_USART_DSR            (_U(0x1) << US_CSR_USART_DSR_Pos)
#define   US_CSR_USART_DSR_0_Val          _U(0x0)   /**< \brief (US_CSR_USART) DSR is at 0 */
#define   US_CSR_USART_DSR_1_Val          _U(0x1)   /**< \brief (US_CSR_USART) DSR is at 1 */
#define US_CSR_USART_DSR_0          (US_CSR_USART_DSR_0_Val        << US_CSR_USART_DSR_Pos)
#define US_CSR_USART_DSR_1          (US_CSR_USART_DSR_1_Val        << US_CSR_USART_DSR_Pos)
#define US_CSR_USART_DCD_Pos        22           /**< \brief (US_CSR_USART) Image of DCD Input */
#define US_CSR_USART_DCD            (_U(0x1) << US_CSR_USART_DCD_Pos)
#define   US_CSR_USART_DCD_0_Val          _U(0x0)   /**< \brief (US_CSR_USART) DCD is at 0 */
#define   US_CSR_USART_DCD_1_Val          _U(0x1)   /**< \brief (US_CSR_USART) DCD is at 1 */
#define US_CSR_USART_DCD_0          (US_CSR_USART_DCD_0_Val        << US_CSR_USART_DCD_Pos)
#define US_CSR_USART_DCD_1          (US_CSR_USART_DCD_1_Val        << US_CSR_USART_DCD_Pos)
#define US_CSR_USART_CTS_Pos        23           /**< \brief (US_CSR_USART) Image of CTS Input */
#define US_CSR_USART_CTS            (_U(0x1) << US_CSR_USART_CTS_Pos)
#define   US_CSR_USART_CTS_0_Val          _U(0x0)   /**< \brief (US_CSR_USART) CTS is at 0 */
#define   US_CSR_USART_CTS_1_Val          _U(0x1)   /**< \brief (US_CSR_USART) CTS is at 1 */
#define US_CSR_USART_CTS_0          (US_CSR_USART_CTS_0_Val        << US_CSR_USART_CTS_Pos)
#define US_CSR_USART_CTS_1          (US_CSR_USART_CTS_1_Val        << US_CSR_USART_CTS_Pos)
#define US_CSR_USART_MANERR_Pos     24           /**< \brief (US_CSR_USART) Manchester Error */
#define US_CSR_USART_MANERR         (_U(0x1) << US_CSR_USART_MANERR_Pos)
#define   US_CSR_USART_MANERR_0_Val       _U(0x0)   /**< \brief (US_CSR_USART) No Manchester error has been detected since the last RSTSTA */
#define   US_CSR_USART_MANERR_1_Val       _U(0x1)   /**< \brief (US_CSR_USART) At least one Manchester error has been detected since the last RSTSTA */
#define US_CSR_USART_MANERR_0       (US_CSR_USART_MANERR_0_Val     << US_CSR_USART_MANERR_Pos)
#define US_CSR_USART_MANERR_1       (US_CSR_USART_MANERR_1_Val     << US_CSR_USART_MANERR_Pos)
#define US_CSR_USART_MASK           _U(0x01FF3FE7) /**< \brief (US_CSR_USART) MASK Register */

