frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
#define US_RHR_OFFSET               0x18         /**< \brief (US_RHR offset) Receiver Holding Register */
#define US_RHR_RESETVALUE           _U(0x00000000); /**< \brief (US_RHR reset_value) Receiver Holding Register */

#define US_RHR_RXCHR_Pos            0            /**< \brief (US_RHR) Received Character */
#define US_RHR_RXCHR_Msk            (_U(0x1FF) << US_RHR_RXCHR_Pos)
#define US_RHR_RXCHR(value)         (US_RHR_RXCHR_Msk & ((value) << US_RHR_RXCHR_Pos))
#define US_RHR_RXSYNH_Pos           15           /**< \brief (US_RHR) Received Sync */
#define US_RHR_RXSYNH               (_U(0x1) << US_RHR_RXSYNH_Pos)
#define   US_RHR_RXSYNH_0_Val             _U(0x0)   /**< \brief (US_RHR) Last character received is a Data */
#define   US_RHR_RXSYNH_1_Val             _U(0x1)   /**< \brief (US_RHR) Last character received is a Command */
#define US_RHR_RXSYNH_0             (US_RHR_RXSYNH_0_Val           << US_RHR_RXSYNH_Pos)
#define US_RHR_RXSYNH_1             (US_RHR_RXSYNH_1_Val           << US_RHR_RXSYNH_Pos)
#define US_RHR_MASK                 _U(0x000081FF) /**< \brief (US_RHR) MASK Register */

/* -------- US_THR : (USART Offset: 0x1C) ( /W 32) Transmitter Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXCHR:9;          /*!< bit:  0.. 8  Character to be Transmitted        */
    uint32_t :6;               /*!< bit:  9..14  Reserved                           */
    uint32_t TXSYNH:1;         /*!< bit:     15  Sync Field to be transmitted       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_THR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_THR_OFFSET               0x1C         /**< \brief (US_THR offset) Transmitter Holding Register */
#define US_THR_RESETVALUE           _U(0x00000000); /**< \brief (US_THR reset_value) Transmitter Holding Register */

#define US_THR_TXCHR_Pos            0            /**< \brief (US_THR) Character to be Transmitted */
#define US_THR_TXCHR_Msk            (_U(0x1FF) << US_THR_TXCHR_Pos)
#define US_THR_TXCHR(value)         (US_THR_TXCHR_Msk & ((value) << US_THR_TXCHR_Pos))
#define US_THR_TXSYNH_Pos           15           /**< \brief (US_THR) Sync Field to be transmitted */
#define US_THR_TXSYNH               (_U(0x1) << US_THR_TXSYNH_Pos)
#define   US_THR_TXSYNH_0_Val             _U(0x0)   /**< \brief (US_THR) The next character sent is encoded as a data. Start Frame Delimiter is DATA SYNC */
#define   US_THR_TXSYNH_1_Val             _U(0x1)   /**< \brief (US_THR) The next character sent is encoded as a command. Start Frame Delimiter is COMMAND SYNC */
#define US_THR_TXSYNH_0             (US_THR_TXSYNH_0_Val           << US_THR_TXSYNH_Pos)
#define US_THR_TXSYNH_1             (US_THR_TXSYNH_1_Val           << US_THR_TXSYNH_Pos)
#define US_THR_MASK                 _U(0x000081FF) /**< \brief (US_THR) MASK Register */

/* -------- US_BRGR : (USART Offset: 0x20) (R/W 32) Baud Rate Generator Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t CD:16;            /*!< bit:  0..15  Clock Divisor                      */
    uint32_t FP:3;             /*!< bit: 16..18  Fractional Part                    */
    uint32_t :13;              /*!< bit: 19..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_BRGR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_BRGR_OFFSET              0x20         /**< \brief (US_BRGR offset) Baud Rate Generator Register */
#define US_BRGR_RESETVALUE          _U(0x00000000); /**< \brief (US_BRGR reset_value) Baud Rate Generator Register */

#define US_BRGR_CD_Pos              0            /**< \brief (US_BRGR) Clock Divisor */
#define US_BRGR_CD_Msk              (_U(0xFFFF) << US_BRGR_CD_Pos)
#define US_BRGR_CD(value)           (US_BRGR_CD_Msk & ((value) << US_BRGR_CD_Pos))
#define   US_BRGR_CD_DISABLE_Val          _U(0x0)   /**< \brief (US_BRGR) Disables the clock */
#define   US_BRGR_CD_BYPASS_Val           _U(0x1)   /**< \brief (US_BRGR) Clock Divisor Bypass */
#define   US_BRGR_CD_2_Val                _U(0x2)   /**< \brief (US_BRGR) Baud Rate (Asynchronous Mode) = Selected Clock/(16 x CD) or (8 x CD); Baud Rate (Synchronous Mode) = Selected Clock/CD; */
#define US_BRGR_CD_DISABLE          (US_BRGR_CD_DISABLE_Val        << US_BRGR_CD_Pos)
#define US_BRGR_CD_BYPASS           (US_BRGR_CD_BYPASS_Val         << US_BRGR_CD_Pos)
#define US_BRGR_CD_2                (US_BRGR_CD_2_Val              << US_BRGR_CD_Pos)
#define US_BRGR_FP_Pos              16           /**< \brief (US_BRGR) Fractional Part */
#define US_BRGR_FP_Msk              (_U(0x7) << US_BRGR_FP_Pos)
#define US_BRGR_FP(value)           (US_BRGR_FP_Msk & ((value) << US_BRGR_FP_Pos))
#define   US_BRGR_FP_0_Val                _U(0x0)   /**< \brief (US_BRGR) Fractional divider is disabled */
#define US_BRGR_FP_0                (US_BRGR_FP_0_Val              << US_BRGR_FP_Pos)
#define US_BRGR_MASK                _U(0x0007FFFF) /**< \brief (US_BRGR) MASK Register */

/* -------- US_RTOR : (USART Offset: 0x24) (R/W 32) Receiver Time-out Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TO:17;            /*!< bit:  0..16  Time-out Value                     */
    uint32_t :15;              /*!< bit: 17..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_RTOR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_RTOR_OFFSET              0x24         /**< \brief (US_RTOR offset) Receiver Time-out Register */
#define US_RTOR_RESETVALUE          _U(0x00000000); /**< \brief (US_RTOR reset_value) Receiver Time-out Register */

#define US_RTOR_TO_Pos              0            /**< \brief (US_RTOR) Time-out Value */
#define US_RTOR_TO_Msk              (_U(0x1FFFF) << US_RTOR_TO_Pos)
#define US_RTOR_TO(value)           (US_RTOR_TO_Msk & ((value) << US_RTOR_TO_Pos))
#define   US_RTOR_TO_DISABLE_Val          _U(0x0)   /**< \brief (US_RTOR) Disables the RX Time-out function */
#define US_RTOR_TO_DISABLE          (US_RTOR_TO_DISABLE_Val        << US_RTOR_TO_Pos)
#define US_RTOR_MASK                _U(0x0001FFFF) /**< \brief (US_RTOR) MASK Register */

/* -------- US_TTGR : (USART Offset: 0x28) (R/W 32) Transmitter Timeguard Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TG:8;             /*!< bit:  0.. 7  Timeguard Value                    */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_TTGR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_TTGR_OFFSET              0x28         /**< \brief (US_TTGR offset) Transmitter Timeguard Register */
#define US_TTGR_RESETVALUE          _U(0x00000000); /**< \brief (US_TTGR reset_value) Transmitter Timeguard Register */

