frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
#define US_TTGR_TG_Pos              0            /**< \brief (US_TTGR) Timeguard Value */
#define US_TTGR_TG_Msk              (_U(0xFF) << US_TTGR_TG_Pos)
#define US_TTGR_TG(value)           (US_TTGR_TG_Msk & ((value) << US_TTGR_TG_Pos))
#define   US_TTGR_TG_DISABLE_Val          _U(0x0)   /**< \brief (US_TTGR) Disables the TX Timeguard function. */
#define US_TTGR_TG_DISABLE          (US_TTGR_TG_DISABLE_Val        << US_TTGR_TG_Pos)
#define US_TTGR_MASK                _U(0x000000FF) /**< \brief (US_TTGR) MASK Register */

/* -------- US_FIDI : (USART Offset: 0x40) (R/W 32) FI DI Ratio Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FI_DI_RATIO:11;   /*!< bit:  0..10  FI Over DI Ratio Value             */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_FIDI_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_FIDI_OFFSET              0x40         /**< \brief (US_FIDI offset) FI DI Ratio Register */
#define US_FIDI_RESETVALUE          _U(0x00000174); /**< \brief (US_FIDI reset_value) FI DI Ratio Register */

#define US_FIDI_FI_DI_RATIO_Pos     0            /**< \brief (US_FIDI) FI Over DI Ratio Value */
#define US_FIDI_FI_DI_RATIO_Msk     (_U(0x7FF) << US_FIDI_FI_DI_RATIO_Pos)
#define US_FIDI_FI_DI_RATIO(value)  (US_FIDI_FI_DI_RATIO_Msk & ((value) << US_FIDI_FI_DI_RATIO_Pos))
#define   US_FIDI_FI_DI_RATIO_DISABLE_Val _U(0x0)   /**< \brief (US_FIDI) Baud Rate = 0 */
#define US_FIDI_FI_DI_RATIO_DISABLE (US_FIDI_FI_DI_RATIO_DISABLE_Val << US_FIDI_FI_DI_RATIO_Pos)
#define US_FIDI_MASK                _U(0x000007FF) /**< \brief (US_FIDI) MASK Register */

/* -------- US_NER : (USART Offset: 0x44) (R/  32) Number of Errors Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NB_ERRORS:8;      /*!< bit:  0.. 7  Error number during ISO7816 transfers */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_NER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_NER_OFFSET               0x44         /**< \brief (US_NER offset) Number of Errors Register */
#define US_NER_RESETVALUE           _U(0x00000000); /**< \brief (US_NER reset_value) Number of Errors Register */

#define US_NER_NB_ERRORS_Pos        0            /**< \brief (US_NER) Error number during ISO7816 transfers */
#define US_NER_NB_ERRORS_Msk        (_U(0xFF) << US_NER_NB_ERRORS_Pos)
#define US_NER_NB_ERRORS(value)     (US_NER_NB_ERRORS_Msk & ((value) << US_NER_NB_ERRORS_Pos))
#define US_NER_MASK                 _U(0x000000FF) /**< \brief (US_NER) MASK Register */

/* -------- US_IFR : (USART Offset: 0x4C) (R/W 32) IrDA Filter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t IRDA_FILTER:8;    /*!< bit:  0.. 7  Irda filter                        */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_IFR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_IFR_OFFSET               0x4C         /**< \brief (US_IFR offset) IrDA Filter Register */
#define US_IFR_RESETVALUE           _U(0x00000000); /**< \brief (US_IFR reset_value) IrDA Filter Register */

#define US_IFR_IRDA_FILTER_Pos      0            /**< \brief (US_IFR) Irda filter */
#define US_IFR_IRDA_FILTER_Msk      (_U(0xFF) << US_IFR_IRDA_FILTER_Pos)
#define US_IFR_IRDA_FILTER(value)   (US_IFR_IRDA_FILTER_Msk & ((value) << US_IFR_IRDA_FILTER_Pos))
#define US_IFR_MASK                 _U(0x000000FF) /**< \brief (US_IFR) MASK Register */

/* -------- US_MAN : (USART Offset: 0x50) (R/W 32) Manchester Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TX_PL:4;          /*!< bit:  0.. 3  Transmitter Preamble Length        */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t TX_PP:2;          /*!< bit:  8.. 9  Transmitter Preamble Pattern       */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t TX_MPOL:1;        /*!< bit:     12  Transmitter Manchester Polarity    */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t RX_PL:4;          /*!< bit: 16..19  Receiver Preamble Length           */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t RX_PP:2;          /*!< bit: 24..25  Receiver Preamble Pattern detected */
    uint32_t :2;               /*!< bit: 26..27  Reserved                           */
    uint32_t RX_MPOL:1;        /*!< bit:     28  Receiver Manchester Polarity       */
    uint32_t :1;               /*!< bit:     29  Reserved                           */
    uint32_t DRIFT:1;          /*!< bit:     30  Drift compensation                 */
    uint32_t :1;               /*!< bit:     31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_MAN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_MAN_OFFSET               0x50         /**< \brief (US_MAN offset) Manchester Configuration Register */
#define US_MAN_RESETVALUE           _U(0x30011004); /**< \brief (US_MAN reset_value) Manchester Configuration Register */

#define US_MAN_TX_PL_Pos            0            /**< \brief (US_MAN) Transmitter Preamble Length */
#define US_MAN_TX_PL_Msk            (_U(0xF) << US_MAN_TX_PL_Pos)
#define US_MAN_TX_PL(value)         (US_MAN_TX_PL_Msk & ((value) << US_MAN_TX_PL_Pos))
#define   US_MAN_TX_PL_0_Val              _U(0x0)   /**< \brief (US_MAN) The Transmitter Preamble pattern generation is disabled */
#define US_MAN_TX_PL_0              (US_MAN_TX_PL_0_Val            << US_MAN_TX_PL_Pos)
#define US_MAN_TX_PP_Pos            8            /**< \brief (US_MAN) Transmitter Preamble Pattern */
#define US_MAN_TX_PP_Msk            (_U(0x3) << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP(value)         (US_MAN_TX_PP_Msk & ((value) << US_MAN_TX_PP_Pos))
#define   US_MAN_TX_PP_0_Val              _U(0x0)   /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_TX_PP_1_Val              _U(0x1)   /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_TX_PP_2_Val              _U(0x2)   /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_TX_PP_3_Val              _U(0x3)   /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_TX_PP_0              (US_MAN_TX_PP_0_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP_1              (US_MAN_TX_PP_1_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP_2              (US_MAN_TX_PP_2_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_PP_3              (US_MAN_TX_PP_3_Val            << US_MAN_TX_PP_Pos)
#define US_MAN_TX_MPOL_Pos          12           /**< \brief (US_MAN) Transmitter Manchester Polarity */
#define US_MAN_TX_MPOL              (_U(0x1) << US_MAN_TX_MPOL_Pos)
#define   US_MAN_TX_MPOL_0_Val            _U(0x0)   /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_TX_MPOL_1_Val            _U(0x1)   /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_TX_MPOL_0            (US_MAN_TX_MPOL_0_Val          << US_MAN_TX_MPOL_Pos)
#define US_MAN_TX_MPOL_1            (US_MAN_TX_MPOL_1_Val          << US_MAN_TX_MPOL_Pos)
#define US_MAN_RX_PL_Pos            16           /**< \brief (US_MAN) Receiver Preamble Length */
#define US_MAN_RX_PL_Msk            (_U(0xF) << US_MAN_RX_PL_Pos)
#define US_MAN_RX_PL(value)         (US_MAN_RX_PL_Msk & ((value) << US_MAN_RX_PL_Pos))
#define   US_MAN_RX_PL_0_Val              _U(0x0)   /**< \brief (US_MAN) The receiver preamble pattern detection is disabled */
#define US_MAN_RX_PL_0              (US_MAN_RX_PL_0_Val            << US_MAN_RX_PL_Pos)
#define US_MAN_RX_PP_Pos            24           /**< \brief (US_MAN) Receiver Preamble Pattern detected */
#define US_MAN_RX_PP_Msk            (_U(0x3) << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP(value)         (US_MAN_RX_PP_Msk & ((value) << US_MAN_RX_PP_Pos))
#define   US_MAN_RX_PP_0_Val              _U(0x0)   /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_RX_PP_1_Val              _U(0x1)   /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_RX_PP_2_Val              _U(0x2)   /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_RX_PP_3_Val              _U(0x3)   /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_RX_PP_0              (US_MAN_RX_PP_0_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP_1              (US_MAN_RX_PP_1_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP_2              (US_MAN_RX_PP_2_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_PP_3              (US_MAN_RX_PP_3_Val            << US_MAN_RX_PP_Pos)
#define US_MAN_RX_MPOL_Pos          28           /**< \brief (US_MAN) Receiver Manchester Polarity */
#define US_MAN_RX_MPOL              (_U(0x1) << US_MAN_RX_MPOL_Pos)
#define   US_MAN_RX_MPOL_0_Val            _U(0x0)   /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_RX_MPOL_1_Val            _U(0x1)   /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_RX_MPOL_0            (US_MAN_RX_MPOL_0_Val          << US_MAN_RX_MPOL_Pos)
#define US_MAN_RX_MPOL_1            (US_MAN_RX_MPOL_1_Val          << US_MAN_RX_MPOL_Pos)
#define US_MAN_DRIFT_Pos            30           /**< \brief (US_MAN) Drift compensation */
#define US_MAN_DRIFT                (_U(0x1) << US_MAN_DRIFT_Pos)
#define   US_MAN_DRIFT_0_Val              _U(0x0)   /**< \brief (US_MAN) The USART can not recover from an important clock drift */
#define   US_MAN_DRIFT_1_Val              _U(0x1)   /**< \brief (US_MAN) The USART can recover from clock drift. The 16X clock mode must be enabled */
#define US_MAN_DRIFT_0              (US_MAN_DRIFT_0_Val            << US_MAN_DRIFT_Pos)
#define US_MAN_DRIFT_1              (US_MAN_DRIFT_1_Val            << US_MAN_DRIFT_Pos)
#define US_MAN_MASK                 _U(0x530F130F) /**< \brief (US_MAN) MASK Register */

/* -------- US_LINMR : (USART Offset: 0x54) (R/W 32) LIN Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NACT:2;           /*!< bit:  0.. 1  LIN Node Action                    */
    uint32_t PARDIS:1;         /*!< bit:      2  Parity Disable                     */
    uint32_t CHKDIS:1;         /*!< bit:      3  Checksum Disable                   */
    uint32_t CHKTYP:1;         /*!< bit:      4  Checksum Type                      */
    uint32_t DLM:1;            /*!< bit:      5  Data Length Mode                   */
    uint32_t FSDIS:1;          /*!< bit:      6  Frame Slot Mode Disable            */
    uint32_t WKUPTYP:1;        /*!< bit:      7  Wakeup Signal Type                 */
    uint32_t DLC:8;            /*!< bit:  8..15  Data Length Control                */
    uint32_t PDCM:1;           /*!< bit:     16  PDC Mode                           */
    uint32_t SYNCDIS:1;        /*!< bit:     17  Synchronization Disable            */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_LINMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

