frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usart.h
#define US_WPMR_OFFSET              0xE4         /**< \brief (US_WPMR offset) Write Protect Mode Register */
#define US_WPMR_RESETVALUE          _U(0x00000000); /**< \brief (US_WPMR reset_value) Write Protect Mode Register */

#define US_WPMR_WPEN_Pos            0            /**< \brief (US_WPMR) Write Protect Enable */
#define US_WPMR_WPEN                (_U(0x1) << US_WPMR_WPEN_Pos)
#define   US_WPMR_WPEN_0_Val              _U(0x0)   /**< \brief (US_WPMR) Disables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define   US_WPMR_WPEN_1_Val              _U(0x1)   /**< \brief (US_WPMR) Enables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define US_WPMR_WPEN_0              (US_WPMR_WPEN_0_Val            << US_WPMR_WPEN_Pos)
#define US_WPMR_WPEN_1              (US_WPMR_WPEN_1_Val            << US_WPMR_WPEN_Pos)
#define US_WPMR_WPKEY_Pos           8            /**< \brief (US_WPMR) Write Protect Key */
#define US_WPMR_WPKEY_Msk           (_U(0xFFFFFF) << US_WPMR_WPKEY_Pos)
#define US_WPMR_WPKEY(value)        (US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos))
#define US_WPMR_MASK                _U(0xFFFFFF01) /**< \brief (US_WPMR) MASK Register */

/* -------- US_WPSR : (USART Offset: 0xE8) (R/  32) Write Protect Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t WPV:1;            /*!< bit:      0  Write Protect Violation Status     */
    uint32_t :7;               /*!< bit:  1.. 7  Reserved                           */
    uint32_t WPVSRC:16;        /*!< bit:  8..23  Write Protect Violation Source     */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_WPSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_WPSR_OFFSET              0xE8         /**< \brief (US_WPSR offset) Write Protect Status Register */
#define US_WPSR_RESETVALUE          _U(0x00000000); /**< \brief (US_WPSR reset_value) Write Protect Status Register */

#define US_WPSR_WPV_Pos             0            /**< \brief (US_WPSR) Write Protect Violation Status */
#define US_WPSR_WPV                 (_U(0x1) << US_WPSR_WPV_Pos)
#define   US_WPSR_WPV_0_Val               _U(0x0)   /**< \brief (US_WPSR) No Write Protect Violation has occurred since the last read of the WPSR register */
#define   US_WPSR_WPV_1_Val               _U(0x1)   /**< \brief (US_WPSR) A Write Protect Violation has occurred since the last read of the WPSR register. If this violation is an unauthorized attempt to write a protected register, the associated violation is reported into field WPVSRC */
#define US_WPSR_WPV_0               (US_WPSR_WPV_0_Val             << US_WPSR_WPV_Pos)
#define US_WPSR_WPV_1               (US_WPSR_WPV_1_Val             << US_WPSR_WPV_Pos)
#define US_WPSR_WPVSRC_Pos          8            /**< \brief (US_WPSR) Write Protect Violation Source */
#define US_WPSR_WPVSRC_Msk          (_U(0xFFFF) << US_WPSR_WPVSRC_Pos)
#define US_WPSR_WPVSRC(value)       (US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos))
#define US_WPSR_MASK                _U(0x00FFFF01) /**< \brief (US_WPSR) MASK Register */

/* -------- US_VERSION : (USART Offset: 0xFC) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version                            */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t MFN:4;            /*!< bit: 16..19  MFN                                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} US_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_VERSION_OFFSET           0xFC         /**< \brief (US_VERSION offset) Version Register */
#define US_VERSION_RESETVALUE       _U(0x00000602); /**< \brief (US_VERSION reset_value) Version Register */

#define US_VERSION_VERSION_Pos      0            /**< \brief (US_VERSION) Version */
#define US_VERSION_VERSION_Msk      (_U(0xFFF) << US_VERSION_VERSION_Pos)
#define US_VERSION_VERSION(value)   (US_VERSION_VERSION_Msk & ((value) << US_VERSION_VERSION_Pos))
#define US_VERSION_MFN_Pos          16           /**< \brief (US_VERSION) MFN */
#define US_VERSION_MFN_Msk          (_U(0xF) << US_VERSION_MFN_Pos)
#define US_VERSION_MFN(value)       (US_VERSION_MFN_Msk & ((value) << US_VERSION_MFN_Pos))
#define US_VERSION_MASK             _U(0x000F0FFF) /**< \brief (US_VERSION) MASK Register */

/** \brief USART hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  US_CR_Type                CR;          /**< \brief Offset: 0x00 ( /W 32) Control Register */
  __IO US_MR_Type                MR;          /**< \brief Offset: 0x04 (R/W 32) Mode Register */
  __O  US_IER_Type               IER;         /**< \brief Offset: 0x08 ( /W 32) Interrupt Enable Register */
  __O  US_IDR_Type               IDR;         /**< \brief Offset: 0x0C ( /W 32) Interrupt Disable Register */
  __I  US_IMR_Type               IMR;         /**< \brief Offset: 0x10 (R/  32) Interrupt Mask Register */
  __I  US_CSR_Type               CSR;         /**< \brief Offset: 0x14 (R/  32) Channel Status Register */
  __I  US_RHR_Type               RHR;         /**< \brief Offset: 0x18 (R/  32) Receiver Holding Register */
  __O  US_THR_Type               THR;         /**< \brief Offset: 0x1C ( /W 32) Transmitter Holding Register */
  __IO US_BRGR_Type              BRGR;        /**< \brief Offset: 0x20 (R/W 32) Baud Rate Generator Register */
  __IO US_RTOR_Type              RTOR;        /**< \brief Offset: 0x24 (R/W 32) Receiver Time-out Register */
  __IO US_TTGR_Type              TTGR;        /**< \brief Offset: 0x28 (R/W 32) Transmitter Timeguard Register */
       RoReg8                    Reserved1[0x14];
  __IO US_FIDI_Type              FIDI;        /**< \brief Offset: 0x40 (R/W 32) FI DI Ratio Register */
  __I  US_NER_Type               NER;         /**< \brief Offset: 0x44 (R/  32) Number of Errors Register */
       RoReg8                    Reserved2[0x4];
  __IO US_IFR_Type               IFR;         /**< \brief Offset: 0x4C (R/W 32) IrDA Filter Register */
  __IO US_MAN_Type               MAN;         /**< \brief Offset: 0x50 (R/W 32) Manchester Configuration Register */
  __IO US_LINMR_Type             LINMR;       /**< \brief Offset: 0x54 (R/W 32) LIN Mode Register */
  __IO US_LINIR_Type             LINIR;       /**< \brief Offset: 0x58 (R/W 32) LIN Identifier Register */
  __I  US_LINBRR_Type            LINBRR;      /**< \brief Offset: 0x5C (R/  32) LIN Baud Rate Register */
       RoReg8                    Reserved3[0x84];
  __IO US_WPMR_Type              WPMR;        /**< \brief Offset: 0xE4 (R/W 32) Write Protect Mode Register */
  __I  US_WPSR_Type              WPSR;        /**< \brief Offset: 0xE8 (R/  32) Write Protect Status Register */
       RoReg8                    Reserved4[0x10];
  __I  US_VERSION_Type           VERSION;     /**< \brief Offset: 0xFC (R/  32) Version Register */
 } bf;
 struct {
  WoReg   US_CR;              /**< \brief (USART Offset: 0x00) Control Register */
  RwReg   US_MR;              /**< \brief (USART Offset: 0x04) Mode Register */
  WoReg   US_IER;             /**< \brief (USART Offset: 0x08) Interrupt Enable Register */
  WoReg   US_IDR;             /**< \brief (USART Offset: 0x0C) Interrupt Disable Register */
  RoReg   US_IMR;             /**< \brief (USART Offset: 0x10) Interrupt Mask Register */
  RoReg   US_CSR;             /**< \brief (USART Offset: 0x14) Channel Status Register */
  RoReg   US_RHR;             /**< \brief (USART Offset: 0x18) Receiver Holding Register */
  WoReg   US_THR;             /**< \brief (USART Offset: 0x1C) Transmitter Holding Register */
  RwReg   US_BRGR;            /**< \brief (USART Offset: 0x20) Baud Rate Generator Register */
  RwReg   US_RTOR;            /**< \brief (USART Offset: 0x24) Receiver Time-out Register */
  RwReg   US_TTGR;            /**< \brief (USART Offset: 0x28) Transmitter Timeguard Register */
  RoReg8  Reserved5[0x14];
  RwReg   US_FIDI;            /**< \brief (USART Offset: 0x40) FI DI Ratio Register */
  RoReg   US_NER;             /**< \brief (USART Offset: 0x44) Number of Errors Register */
  RoReg8  Reserved6[0x4];
  RwReg   US_IFR;             /**< \brief (USART Offset: 0x4C) IrDA Filter Register */
  RwReg   US_MAN;             /**< \brief (USART Offset: 0x50) Manchester Configuration Register */
  RwReg   US_LINMR;           /**< \brief (USART Offset: 0x54) LIN Mode Register */
  RwReg   US_LINIR;           /**< \brief (USART Offset: 0x58) LIN Identifier Register */
  RoReg   US_LINBRR;          /**< \brief (USART Offset: 0x5C) LIN Baud Rate Register */
  RoReg8  Reserved7[0x84];
  RwReg   US_WPMR;            /**< \brief (USART Offset: 0xE4) Write Protect Mode Register */
  RoReg   US_WPSR;            /**< \brief (USART Offset: 0xE8) Write Protect Status Register */
  RoReg8  Reserved8[0x10];
  RoReg   US_VERSION;         /**< \brief (USART Offset: 0xFC) Version Register */
 } reg;
} Usart;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_USART_COMPONENT_ */
